lukasl93/msp430fr59941/MSP430FR59941.svd
<!-- Created by tixml2svd; https://github.com/dhoove/tixml2svd -->
<?xml version="1.0" encoding="utf-8"?>
<device>
  <name>MSP430FR59941</name>
  <version>1.1</version>
  <description>16 MHz RISC MCU with 256KB FRAM, 8KB SRAM, LEA, AES, 12-bit ADC , comparator, DMA, 68 IO, eUSCI</description>
  <vendor>Texas Instruments Inc.</vendor>
  <vendorID>TI</vendorID>
  <series>MSP430</series>
  <cpu>
    <name>other</name>
    <revision>r1p0</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
	<dspPresent>true</dspPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>5</nvicPrioBits>
    <vendorSystickConfig>true</vendorSystickConfig>
	<deviceNumInterrupts>32</deviceNumInterrupts>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>16</width>
  <size>16</size>
  <access>read-write</access>
  <resetValue>0x0000</resetValue>
  <resetMask>0xFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>ADC12_B</name>
      <baseAddress>0x0800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADC12CTL0</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>ADC12_B Control 0</description>
          <fields>
            <field>
              <name>ADC12SC</name>
              <description>[0:0] start conversion</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12SC_0</name>
                  <value>0x0</value>
                  <description>No sample-and-conversion-start</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SC_1</name>
                  <value>0x1</value>
                  <description>Start sample-and-conversion</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12ENC</name>
              <description>[1:1] enable conversion</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12ENC_0</name>
                  <value>0x0</value>
                  <description>ADC12_B disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12ENC_1</name>
                  <value>0x1</value>
                  <description>ADC12_B enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12ON</name>
              <description>[4:4] ADC on</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12ON_0</name>
                  <value>0x0</value>
                  <description>ADC12_B off</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12ON_1</name>
                  <value>0x1</value>
                  <description>ADC12_B on</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12MSC</name>
              <description>[7:7] sample-and-hold time.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12MSC_0</name>
                  <value>0x0</value>
                  <description>The sampling timer requires a rising edge of the SHI signal to trigger each sample-and-convert.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12MSC_1</name>
                  <value>0x1</value>
                  <description>The incidence of a positive(or for devices first rising edge of the) SHI signal triggers the sampling timer, but further sample-and-conversions are performed automatically as soon as the prior conversion is completed.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12SHT0</name>
              <description>[11:8] sample-and-hold time.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12SHT0_0</name>
                  <value>0x0</value>
                  <description>4 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_1</name>
                  <value>0x1</value>
                  <description>8 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_2</name>
                  <value>0x2</value>
                  <description>16 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_3</name>
                  <value>0x3</value>
                  <description>32 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_4</name>
                  <value>0x4</value>
                  <description>64 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_5</name>
                  <value>0x5</value>
                  <description>96 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_6</name>
                  <value>0x6</value>
                  <description>128 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_7</name>
                  <value>0x7</value>
                  <description>192 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_8</name>
                  <value>0x8</value>
                  <description>256 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_9</name>
                  <value>0x9</value>
                  <description>384 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_10</name>
                  <value>0xA</value>
                  <description>512 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_11</name>
                  <value>0xB</value>
                  <description>Reserved</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_12</name>
                  <value>0xC</value>
                  <description>Reserved</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_13</name>
                  <value>0xD</value>
                  <description>Reserved</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_14</name>
                  <value>0xE</value>
                  <description>Reserved</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_15</name>
                  <value>0xF</value>
                  <description>Reserved</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12SHT1</name>
              <description>[15:12] sample-and-hold time.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12SHT1_0</name>
                  <value>0x0</value>
                  <description>4 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_1</name>
                  <value>0x1</value>
                  <description>8 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_2</name>
                  <value>0x2</value>
                  <description>16 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_3</name>
                  <value>0x3</value>
                  <description>32 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_4</name>
                  <value>0x4</value>
                  <description>64 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_5</name>
                  <value>0x5</value>
                  <description>96 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_6</name>
                  <value>0x6</value>
                  <description>128 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_7</name>
                  <value>0x7</value>
                  <description>192 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_8</name>
                  <value>0x8</value>
                  <description>256 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_9</name>
                  <value>0x9</value>
                  <description>384 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_10</name>
                  <value>0xA</value>
                  <description>512 ADC12CLK cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_11</name>
                  <value>0xB</value>
                  <description>Reserved</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_12</name>
                  <value>0xC</value>
                  <description>Reserved</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_13</name>
                  <value>0xD</value>
                  <description>Reserved</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_14</name>
                  <value>0xE</value>
                  <description>Reserved</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_15</name>
                  <value>0xF</value>
                  <description>Reserved</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12CTL1</name>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <description>ADC12_B Control 1</description>
          <fields>
            <field>
              <name>ADC12BUSY</name>
              <description>[0:0] ADC busy</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12BUSY_0</name>
                  <value>0x0</value>
                  <description>No operation is active.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12BUSY_1</name>
                  <value>0x1</value>
                  <description>A sequence, sample, or conversion is active.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12CONSEQ</name>
              <description>[2:1] conversion sequence mode select</description>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12CONSEQ_0</name>
                  <value>0x0</value>
                  <description>Single-channel, single-conversion</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CONSEQ_1</name>
                  <value>0x1</value>
                  <description>Sequence-of-channels</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CONSEQ_2</name>
                  <value>0x2</value>
                  <description>Repeat-single-channel</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CONSEQ_3</name>
                  <value>0x3</value>
                  <description>Repeat-sequence-of-channels</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12SSEL</name>
              <description>[4:3] clock source select</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12SSEL_0</name>
                  <value>0x0</value>
                  <description>ADC12OSC (MODOSC)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SSEL_1</name>
                  <value>0x1</value>
                  <description>ACLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SSEL_2</name>
                  <value>0x2</value>
                  <description>MCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SSEL_3</name>
                  <value>0x3</value>
                  <description>SMCLK</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12DIV</name>
              <description>[7:5] clock divider</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12DIV_0</name>
                  <value>0x0</value>
                  <description>/1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_1</name>
                  <value>0x1</value>
                  <description>/2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_2</name>
                  <value>0x2</value>
                  <description>/3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_3</name>
                  <value>0x3</value>
                  <description>/4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_4</name>
                  <value>0x4</value>
                  <description>/5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_5</name>
                  <value>0x5</value>
                  <description>/6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_6</name>
                  <value>0x6</value>
                  <description>/7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_7</name>
                  <value>0x7</value>
                  <description>/8</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12ISSH</name>
              <description>[8:8] invert signal sample-and-hold</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12ISSH_0</name>
                  <value>0x0</value>
                  <description>The sample-input signal is not inverted.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12ISSH_1</name>
                  <value>0x1</value>
                  <description>The sample-input signal is inverted.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12SHP</name>
              <description>[9:9] sample-and-hold pulse-mode select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12SHP_0</name>
                  <value>0x0</value>
                  <description>SAMPCON signal is sourced from the sample-input signal.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHP_1</name>
                  <value>0x1</value>
                  <description>SAMPCON signal is sourced from the sampling timer.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12SHS</name>
              <description>[12:10] sample-and-hold source select</description>
              <bitWidth>3</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12SHS_0</name>
                  <value>0x0</value>
                  <description>ADC12SC bit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHS_1</name>
                  <value>0x1</value>
                  <description>see the device-specific data sheet for source</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHS_2</name>
                  <value>0x2</value>
                  <description>see the device-specific data sheet for source</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHS_3</name>
                  <value>0x3</value>
                  <description>see the device-specific data sheet for source</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHS_4</name>
                  <value>0x4</value>
                  <description>see the device-specific data sheet for source</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHS_5</name>
                  <value>0x5</value>
                  <description>see the device-specific data sheet for source</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHS_6</name>
                  <value>0x6</value>
                  <description>see the device-specific data sheet for source</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHS_7</name>
                  <value>0x7</value>
                  <description>see the device-specific data sheet for source</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12PDIV</name>
              <description>[14:13] predivider</description>
              <bitWidth>2</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <value>0x0</value>
                  <description>Predivide by 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>0x1</value>
                  <description>Predivide by 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <value>0x2</value>
                  <description>Predivide by 32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <value>0x3</value>
                  <description>Predivide by 64</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
