lukasl93/msp430fr59941/MSP430FR59941.svd
        <register>
          <name>ADC12MCTL31</name>
          <addressOffset>0x5E</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory Control 0 Register to ADC12_B Memory Control 31 Register</description>
          <fields>
            <field>
              <name>ADC12INCH</name>
              <description>[4:0] Input channel select</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12INCH_0</name>
                  <value>0x0</value>
                  <description>If ADC12DIF = 0: A0; If ADC12DIF = 1: Ain+ = A0, Ain- = A1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_1</name>
                  <value>0x1</value>
                  <description>If ADC12DIF = 0: A1; If ADC12DIF = 1: Ain+ = A0, Ain- = A1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_2</name>
                  <value>0x2</value>
                  <description>If ADC12DIF = 0: A2; If ADC12DIF = 1: Ain+ = A2, Ain- = A3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_3</name>
                  <value>0x3</value>
                  <description>If ADC12DIF = 0: A3; If ADC12DIF = 1: Ain+ = A2, Ain- = A3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_4</name>
                  <value>0x4</value>
                  <description>If ADC12DIF = 0: A4; If ADC12DIF = 1: Ain+ = A4, Ain- = A5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_5</name>
                  <value>0x5</value>
                  <description>If ADC12DIF = 0: A5; If ADC12DIF = 1: Ain+ = A4, Ain- = A5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_6</name>
                  <value>0x6</value>
                  <description>If ADC12DIF = 0: A6; If ADC12DIF = 1: Ain+ = A6, Ain- = A7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_7</name>
                  <value>0x7</value>
                  <description>If ADC12DIF = 0: A7; If ADC12DIF = 1: Ain+ = A6, Ain- = A7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_8</name>
                  <value>0x8</value>
                  <description>If ADC12DIF = 0: A8; If ADC12DIF = 1: Ain+ = A8, Ain- = A9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_9</name>
                  <value>0x9</value>
                  <description>If ADC12DIF = 0: A9; If ADC12DIF = 1: Ain+ = A8, Ain- = A9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_10</name>
                  <value>0xA</value>
                  <description>If ADC12DIF = 0: A10; If ADC12DIF = 1: Ain+ = A10, Ain- = A11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_11</name>
                  <value>0xB</value>
                  <description>If ADC12DIF = 0: A11; If ADC12DIF = 1: Ain+ = A10, Ain- = A11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_12</name>
                  <value>0xC</value>
                  <description>If ADC12DIF = 0: A12; If ADC12DIF = 1: Ain+ = A12, Ain- = A13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_13</name>
                  <value>0xD</value>
                  <description>If ADC12DIF = 0: A13; If ADC12DIF = 1: Ain+ = A12, Ain- = A13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_14</name>
                  <value>0xE</value>
                  <description>If ADC12DIF = 0: A14; If ADC12DIF = 1: Ain+ = A14, Ain- = A15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_15</name>
                  <value>0xF</value>
                  <description>If ADC12DIF = 0: A15; If ADC12DIF = 1: Ain+ = A14, Ain- = A15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_16</name>
                  <value>0x10</value>
                  <description>If ADC12DIF = 0: A16; If ADC12DIF = 1: Ain+ = A16, Ain- = A17</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_17</name>
                  <value>0x11</value>
                  <description>If ADC12DIF = 0: A17; If ADC12DIF = 1: Ain+ = A16, Ain- = A17</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_18</name>
                  <value>0x12</value>
                  <description>If ADC12DIF = 0: A18; If ADC12DIF = 1: Ain+ = A18, Ain- = A19</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_19</name>
                  <value>0x13</value>
                  <description>If ADC12DIF = 0: A19; If ADC12DIF = 1: Ain+ = A18, Ain- = A19</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_20</name>
                  <value>0x14</value>
                  <description>If ADC12DIF = 0: A20; If ADC12DIF = 1: Ain+ = A20, Ain- = A21</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_21</name>
                  <value>0x15</value>
                  <description>If ADC12DIF = 0: A21; If ADC12DIF = 1: Ain+ = A20, Ain- = A21</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_22</name>
                  <value>0x16</value>
                  <description>If ADC12DIF = 0: A22; If ADC12DIF = 1: Ain+ = A22, Ain- = A23</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_23</name>
                  <value>0x17</value>
                  <description>If ADC12DIF = 0: A23; If ADC12DIF = 1: Ain+ = A22, Ain- = A23</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_24</name>
                  <value>0x18</value>
                  <description>If ADC12DIF = 0: A24; If ADC12DIF = 1: Ain+ = A24, Ain- = A25</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_25</name>
                  <value>0x19</value>
                  <description>If ADC12DIF = 0: A25; If ADC12DIF = 1: Ain+ = A24, Ain- = A25</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_26</name>
                  <value>0x1A</value>
                  <description>If ADC12DIF = 0: A26; If ADC12DIF = 1: Ain+ = A26, Ain- =A27</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_27</name>
                  <value>0x1B</value>
                  <description>If ADC12DIF = 0: A27; If ADC12DIF = 1: Ain+ = A26, Ain- = A27</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_28</name>
                  <value>0x1C</value>
                  <description>If ADC12DIF = 0: A28; If ADC12DIF = 1: Ain+ = A28, Ain- = A29</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_29</name>
                  <value>0x1D</value>
                  <description>If ADC12DIF = 0: A29; If ADC12DIF = 1: Ain+ = A28, Ain- = A29</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_30</name>
                  <value>0x1E</value>
                  <description>If ADC12DIF = 0: A30; If ADC12DIF = 1: Ain+ = A30, Ain- = A31</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_31</name>
                  <value>0x1F</value>
                  <description>If ADC12DIF = 0: A31; If ADC12DIF = 1: Ain+ = A30, Ain- = A31</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12EOS</name>
              <description>[7:7] End of sequence</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12EOS_0</name>
                  <value>0x0</value>
                  <description>Not end of sequence</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12EOS_1</name>
                  <value>0x1</value>
                  <description>End of sequence</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12VRSEL</name>
              <description>[11:8] reference selection</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12VRSEL_0</name>
                  <value>0x0</value>
                  <description>VR+ = AVCC, VR- = AVSS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_1</name>
                  <value>0x1</value>
                  <description>VR+ = VREF buffered, VR- = AVSS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_2</name>
                  <value>0x2</value>
                  <description>VR+ = VeREF-, VR- = AVSS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_3</name>
                  <value>0x3</value>
                  <description>VR+ = VeREF+ buffered, VR- = AVSS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_4</name>
                  <value>0x4</value>
                  <description>VR+ = VeREF+, VR- = AVSS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_5</name>
                  <value>0x5</value>
                  <description>VR+ = AVCC, VR- = VeREF+ buffered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_6</name>
                  <value>0x6</value>
                  <description>VR+ = AVCC, VR- = VeREF+</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_7</name>
                  <value>0x7</value>
                  <description>VR+ = VREF buffered, VR- = VeREF+</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_8</name>
                  <value>0x8</value>
                  <description>Reserved</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_9</name>
                  <value>0x9</value>
                  <description>VR+ = AVCC, VR- = VREF buffered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_10</name>
                  <value>0xA</value>
                  <description>Reserved</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_11</name>
                  <value>0xB</value>
                  <description>VR+ = VeREF+, VR- = VREF buffered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_12</name>
                  <value>0xC</value>
                  <description>VR+ = AVCC, VR- = VeREF-</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_13</name>
                  <value>0xD</value>
                  <description>VR+ = VREF buffered, VR- = VeREF-</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_14</name>
                  <value>0xE</value>
                  <description>VR+ = VeREF+, VR- = VeREF-</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_15</name>
                  <value>0xF</value>
                  <description>VR+ = VeREF+ buffered, VR- = VeREF-</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12DIF</name>
              <description>[13:13] Differential mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12DIF_0</name>
                  <value>0x0</value>
                  <description>Single-ended mode enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIF_1</name>
                  <value>0x1</value>
                  <description>Differential mode enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12WINC</name>
              <description>[14:14] Comparator window enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12WINC_0</name>
                  <value>0x0</value>
                  <description>Comparator window disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12WINC_1</name>
                  <value>0x1</value>
                  <description>Comparator window enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM0</name>
          <addressOffset>0x60</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM1</name>
          <addressOffset>0x62</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM2</name>
          <addressOffset>0x64</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM3</name>
          <addressOffset>0x66</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM4</name>
          <addressOffset>0x68</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM5</name>
          <addressOffset>0x6A</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM6</name>
          <addressOffset>0x6C</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM7</name>
          <addressOffset>0x6E</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM8</name>
          <addressOffset>0x70</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM9</name>
          <addressOffset>0x72</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM10</name>
          <addressOffset>0x74</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM11</name>
          <addressOffset>0x76</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM12</name>
          <addressOffset>0x78</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM13</name>
          <addressOffset>0x7A</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM14</name>
          <addressOffset>0x7C</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM15</name>
          <addressOffset>0x7E</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM16</name>
          <addressOffset>0x80</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM17</name>
          <addressOffset>0x82</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM18</name>
          <addressOffset>0x84</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM19</name>
          <addressOffset>0x86</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM20</name>
          <addressOffset>0x88</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM21</name>
          <addressOffset>0x8A</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM22</name>
          <addressOffset>0x8C</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM23</name>
          <addressOffset>0x8E</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM24</name>
          <addressOffset>0x90</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM25</name>
          <addressOffset>0x92</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM26</name>
          <addressOffset>0x94</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM27</name>
          <addressOffset>0x96</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM28</name>
          <addressOffset>0x98</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM29</name>
          <addressOffset>0x9A</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC12MEM30</name>
          <addressOffset>0x9C</addressOffset>
          <size>16</size>
          <description>ADC12_B Memory 0 Register to ADC12_B Memory 31 Register</description>
          <resetValue>0</resetValue>
        </register>
