lukasl93/msp430fr59941/MSP430FR59941.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CAPTIO1</name>
      <baseAddress>0x0470</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CAPTIO1CTL</name>
          <addressOffset>0xE</addressOffset>
          <size>16</size>
          <description>Capacitive Touch IO 0 Control Register</description>
          <fields>
            <field>
              <name>CAPTIOPISEL1</name>
              <description>[3:1] Capacitive Touch IO pin select</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPTIOPISEL_0</name>
                  <value>0x0</value>
                  <description>Px.0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTIOPISEL_1</name>
                  <value>0x1</value>
                  <description>Px.1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTIOPISEL_2</name>
                  <value>0x2</value>
                  <description>Px.2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTIOPISEL_3</name>
                  <value>0x3</value>
                  <description>Px.3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTIOPISEL_4</name>
                  <value>0x4</value>
                  <description>Px.4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTIOPISEL_5</name>
                  <value>0x5</value>
                  <description>Px.5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTIOPISEL_6</name>
                  <value>0x6</value>
                  <description>Px.6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTIOPISEL_7</name>
                  <value>0x7</value>
                  <description>Px.7</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTIOPOSEL1</name>
              <description>[7:4] Capacitive Touch IO port select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PJ</name>
                  <value>0x0</value>
                  <description>Px = PJ</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1</name>
                  <value>0x1</value>
                  <description>Px = P1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P2</name>
                  <value>0x2</value>
                  <description>Px = P2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3</name>
                  <value>0x3</value>
                  <description>Px = P3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4</name>
                  <value>0x4</value>
                  <description>Px = P4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P5</name>
                  <value>0x5</value>
                  <description>Px = P5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6</name>
                  <value>0x6</value>
                  <description>Px = P6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7</name>
                  <value>0x7</value>
                  <description>Px = P7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8</name>
                  <value>0x8</value>
                  <description>Px = P8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P9</name>
                  <value>0x9</value>
                  <description>Px = P9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P10</name>
                  <value>0xA</value>
                  <description>Px = P10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P11</name>
                  <value>0xB</value>
                  <description>Px = P11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P12</name>
                  <value>0xC</value>
                  <description>Px = P12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P13</name>
                  <value>0xD</value>
                  <description>Px = P13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P14</name>
                  <value>0xE</value>
                  <description>Px = P14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P15</name>
                  <value>0xF</value>
                  <description>Px = P15</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTIOEN</name>
              <description>[8:8] Capacitive Touch IO enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <value>0x0</value>
                  <description>All Capacitive Touch IOs are disabled. Signal towards timers is 0.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <value>0x1</value>
                  <description>Selected Capacitive Touch IO is enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTIO</name>
              <description>[9:9] Capacitive Touch IO state</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPTIO_0</name>
                  <value>0x0</value>
                  <description>Curent state 0 or Capacitive Touch IO is disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTIO_1</name>
                  <value>0x1</value>
                  <description>Current state 1</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
