lukasl93/msp430fr59941/MSP430FR59941.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PA</name>
      <baseAddress>0x0200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PAIN</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>Port A Input</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PAOUT</name>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <description>Port A Output</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PADIR</name>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <description>Port A Direction</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PAREN</name>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <description>Port A Resistor Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PASEL0</name>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <description>Port A Select 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PASEL1</name>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <description>Port A Select 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PASELC</name>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <description>Port A Complement Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PAIES</name>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <description>Port A Interrupt Edge Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PAIE</name>
          <addressOffset>0x1A</addressOffset>
          <size>16</size>
          <description>Port A Interrupt Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PAIFG</name>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <description>Port A Interrupt Flag</description>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>P1</name>
      <baseAddress>0x0200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>P1IV</name>
          <addressOffset>0xE</addressOffset>
          <size>16</size>
          <description>Port 1 Interrupt Vector Register</description>
          <fields>
            <field>
              <name>P1IV</name>
              <description>[4:0] Port 1 interrupt vector value</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1IFG0</name>
                  <value>0x2</value>
                  <description>Interrupt Source: Port 1.0 interrupt; Interrupt Flag: P1IFG0; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1IFG1</name>
                  <value>0x4</value>
                  <description>Interrupt Source: Port 1.1 interrupt; Interrupt Flag: P1IFG1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1IFG2</name>
                  <value>0x6</value>
                  <description>Interrupt Source: Port 1.2 interrupt; Interrupt Flag: P1IFG2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1IFG3</name>
                  <value>0x8</value>
                  <description>Interrupt Source: Port 1.3 interrupt; Interrupt Flag: P1IFG3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1IFG4</name>
                  <value>0xA</value>
                  <description>Interrupt Source: Port 1.4 interrupt; Interrupt Flag: P1IFG4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1IFG5</name>
                  <value>0xC</value>
                  <description>Interrupt Source: Port 1.5 interrupt; Interrupt Flag: P1IFG5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1IFG6</name>
                  <value>0xE</value>
                  <description>Interrupt Source: Port 1.6 interrupt; Interrupt Flag: P1IFG6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1IFG7</name>
                  <value>0x10</value>
                  <description>Interrupt Source: Port 1.7 interrupt; Interrupt Flag: P1IFG7; Interrupt Priority: Lowest</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P1IN</name>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <description>Port 1 Input</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P1OUT</name>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <description>Port 1 Output</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P1DIR</name>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <description>Port 1 Direction</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P1REN</name>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
          <description>Port 1 Resistor Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P1SEL0</name>
          <addressOffset>0xA</addressOffset>
          <size>8</size>
          <description>Port 1 Select 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P1SEL1</name>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <description>Port 1 Select 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P1SELC</name>
          <addressOffset>0x16</addressOffset>
          <size>8</size>
          <description>Port 1 Complement Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P1IES</name>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <description>Port 1 Interrupt Edge Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P1IE</name>
          <addressOffset>0x1A</addressOffset>
          <size>8</size>
          <description>Port 1 Interrupt Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P1IFG</name>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <description>Port 1 Interrupt Flag</description>
          <resetValue>0</resetValue>
        </register>
