lukasl93/msp430fr59941/MSP430FR59941.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>P3</name>
      <baseAddress>0x0200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>P3IV</name>
          <addressOffset>0x2E</addressOffset>
          <size>16</size>
          <description>Port 3 Interrupt Vector Register</description>
          <fields>
            <field>
              <name>P3IV</name>
              <description>[4:0] Port 3 interrupt vector value</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3IFG0</name>
                  <value>0x2</value>
                  <description>Interrupt Source: Port 3.0 interrupt; Interrupt Flag: P3IFG0; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3IFG1</name>
                  <value>0x4</value>
                  <description>Interrupt Source: Port 3.1 interrupt; Interrupt Flag: P3IFG1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3IFG2</name>
                  <value>0x6</value>
                  <description>Interrupt Source: Port 3.2 interrupt; Interrupt Flag: P3IFG2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3IFG3</name>
                  <value>0x8</value>
                  <description>Interrupt Source: Port 3.3 interrupt; Interrupt Flag: P3IFG3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3IFG4</name>
                  <value>0xA</value>
                  <description>Interrupt Source: Port 3.4 interrupt; Interrupt Flag: P3IFG4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3IFG5</name>
                  <value>0xC</value>
                  <description>Interrupt Source: Port 3.5 interrupt; Interrupt Flag: P3IFG5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3IFG6</name>
                  <value>0xE</value>
                  <description>Interrupt Source: Port 3.6 interrupt; Interrupt Flag: P3IFG6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3IFG7</name>
                  <value>0x10</value>
                  <description>Interrupt Source: Port 3.7 interrupt; Interrupt Flag: P3IFG7; Interrupt Priority: Lowest</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P3IN</name>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <description>Port 3 Input</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P3OUT</name>
          <addressOffset>0x22</addressOffset>
          <size>8</size>
          <description>Port 3 Output</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P3DIR</name>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <description>Port 3 Direction</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P3REN</name>
          <addressOffset>0x26</addressOffset>
          <size>8</size>
          <description>Port 3 Resistor Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P3SEL0</name>
          <addressOffset>0x2A</addressOffset>
          <size>8</size>
          <description>Port 3 Select 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P3SEL1</name>
          <addressOffset>0x2C</addressOffset>
          <size>8</size>
          <description>Port 3 Select 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P3SELC</name>
          <addressOffset>0x36</addressOffset>
          <size>8</size>
          <description>Port 3 Complement Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P3IES</name>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
          <description>Port 3 Interrupt Edge Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P3IE</name>
          <addressOffset>0x3A</addressOffset>
          <size>8</size>
          <description>Port 3 Interrupt Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P3IFG</name>
          <addressOffset>0x3C</addressOffset>
          <size>8</size>
          <description>Port 3 Interrupt Flag</description>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>P4</name>
      <baseAddress>0x0200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>P4IV</name>
          <addressOffset>0x3E</addressOffset>
          <size>16</size>
          <description>Port 4 Interrupt Vector Register</description>
          <fields>
            <field>
              <name>P4IV</name>
              <description>[4:0] Port 4 interrupt vector value</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4IFG0</name>
                  <value>0x2</value>
                  <description>Interrupt Source: Port 4.0 interrupt; Interrupt Flag: P4IFG0; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4IFG1</name>
                  <value>0x4</value>
                  <description>Interrupt Source: Port 4.1 interrupt; Interrupt Flag: P4IFG1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4IFG2</name>
                  <value>0x6</value>
                  <description>Interrupt Source: Port 4.2 interrupt; Interrupt Flag: P4IFG2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4IFG3</name>
                  <value>0x8</value>
                  <description>Interrupt Source: Port 4.3 interrupt; Interrupt Flag: P4IFG3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4IFG4</name>
                  <value>0xA</value>
                  <description>Interrupt Source: Port 4.4 interrupt; Interrupt Flag: P4IFG4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4IFG5</name>
                  <value>0xC</value>
                  <description>Interrupt Source: Port 4.5 interrupt; Interrupt Flag: P4IFG5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4IFG6</name>
                  <value>0xE</value>
                  <description>Interrupt Source: Port 4.6 interrupt; Interrupt Flag: P4IFG6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4IFG7</name>
                  <value>0x10</value>
                  <description>Interrupt Source: Port 4.7 interrupt; Interrupt Flag: P4IFG7; Interrupt Priority: Lowest</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P4IN</name>
          <addressOffset>0x21</addressOffset>
          <size>8</size>
          <description>Port 4 Input</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P4OUT</name>
          <addressOffset>0x23</addressOffset>
          <size>8</size>
          <description>Port 4 Output</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P4DIR</name>
          <addressOffset>0x25</addressOffset>
          <size>8</size>
          <description>Port 4 Direction</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P4REN</name>
          <addressOffset>0x27</addressOffset>
          <size>8</size>
          <description>Port 4 Resistor Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P4SEL0</name>
          <addressOffset>0x2B</addressOffset>
          <size>8</size>
          <description>Port 4 Select 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P4SEL1</name>
          <addressOffset>0x2D</addressOffset>
          <size>8</size>
          <description>Port 4 Select 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P4SELC</name>
          <addressOffset>0x37</addressOffset>
          <size>8</size>
          <description>Port 4 Complement Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P4IES</name>
          <addressOffset>0x39</addressOffset>
          <size>8</size>
          <description>Port 4 Interrupt Edge Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P4IE</name>
          <addressOffset>0x3B</addressOffset>
          <size>8</size>
          <description>Port 4 Interrupt Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P4IFG</name>
          <addressOffset>0x3D</addressOffset>
          <size>8</size>
          <description>Port 4 Interrupt Flag</description>
          <resetValue>0</resetValue>
        </register>
