lukasl93/msp430fr59941/MSP430FR59941.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>P6</name>
      <baseAddress>0x0200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>P6IV</name>
          <addressOffset>0x5E</addressOffset>
          <size>16</size>
          <description>Port 6 Interrupt Vector Register</description>
          <fields>
            <field>
              <name>P6IV</name>
              <description>[4:0] Port 6 interrupt vector value</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6IFG0</name>
                  <value>0x2</value>
                  <description>Interrupt Source: Port 6.0 interrupt; Interrupt Flag: P6IFG0; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6IFG1</name>
                  <value>0x4</value>
                  <description>Interrupt Source: Port 6.1 interrupt; Interrupt Flag: P6IFG1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6IFG2</name>
                  <value>0x6</value>
                  <description>Interrupt Source: Port 6.2 interrupt; Interrupt Flag: P6IFG2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6IFG3</name>
                  <value>0x8</value>
                  <description>Interrupt Source: Port 6.3 interrupt; Interrupt Flag: P6IFG3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6IFG4</name>
                  <value>0xA</value>
                  <description>Interrupt Source: Port 6.4 interrupt; Interrupt Flag: P6IFG4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6IFG5</name>
                  <value>0xC</value>
                  <description>Interrupt Source: Port 6.5 interrupt; Interrupt Flag: P6IFG5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6IFG6</name>
                  <value>0xE</value>
                  <description>Interrupt Source: Port 6.6 interrupt; Interrupt Flag: P6IFG6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6IFG7</name>
                  <value>0x10</value>
                  <description>Interrupt Source: Port 6.7 interrupt; Interrupt Flag: P6IFG7; Interrupt Priority: Lowest</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P6IN</name>
          <addressOffset>0x41</addressOffset>
          <size>8</size>
          <description>Port 6 Input</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P6OUT</name>
          <addressOffset>0x43</addressOffset>
          <size>8</size>
          <description>Port 6 Output</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P6DIR</name>
          <addressOffset>0x45</addressOffset>
          <size>8</size>
          <description>Port 6 Direction</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P6REN</name>
          <addressOffset>0x47</addressOffset>
          <size>8</size>
          <description>Port 6 Resistor Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P6SEL0</name>
          <addressOffset>0x4B</addressOffset>
          <size>8</size>
          <description>Port 6 Select 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P6SEL1</name>
          <addressOffset>0x4D</addressOffset>
          <size>8</size>
          <description>Port 6 Select 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P6SELC</name>
          <addressOffset>0x57</addressOffset>
          <size>8</size>
          <description>Port 6 Complement Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P6IES</name>
          <addressOffset>0x59</addressOffset>
          <size>8</size>
          <description>Port 6 Interrupt Edge Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P6IE</name>
          <addressOffset>0x5B</addressOffset>
          <size>8</size>
          <description>Port 6 Interrupt Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P6IFG</name>
          <addressOffset>0x5D</addressOffset>
          <size>8</size>
          <description>Port 6 Interrupt Flag</description>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PD</name>
      <baseAddress>0x0200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PDIN</name>
          <addressOffset>0x60</addressOffset>
          <size>16</size>
          <description>Port D Input</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PDOUT</name>
          <addressOffset>0x62</addressOffset>
          <size>16</size>
          <description>Port D Output</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PDDIR</name>
          <addressOffset>0x64</addressOffset>
          <size>16</size>
          <description>Port D Direction</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PDREN</name>
          <addressOffset>0x66</addressOffset>
          <size>16</size>
          <description>Port D Resistor Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PDSEL0</name>
          <addressOffset>0x6A</addressOffset>
          <size>16</size>
          <description>Port D Select 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PDSEL1</name>
          <addressOffset>0x6C</addressOffset>
          <size>16</size>
          <description>Port D Select 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PDSELC</name>
          <addressOffset>0x76</addressOffset>
          <size>16</size>
          <description>Port D Complement Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PDIES</name>
          <addressOffset>0x78</addressOffset>
          <size>16</size>
          <description>Port D Interrupt Edge Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PDIE</name>
          <addressOffset>0x7A</addressOffset>
          <size>16</size>
          <description>Port D Interrupt Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PDIFG</name>
          <addressOffset>0x7C</addressOffset>
          <size>16</size>
          <description>Port D Interrupt Flag</description>
          <resetValue>0</resetValue>
        </register>
