lukasl93/msp430fr59941/MSP430FR59941.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>P7</name>
      <baseAddress>0x0200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>P7IV</name>
          <addressOffset>0x6E</addressOffset>
          <size>16</size>
          <description>Port 7 Interrupt Vector Register</description>
          <fields>
            <field>
              <name>P7IV</name>
              <description>[4:0] Port 7 interrupt vector value</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7IFG0</name>
                  <value>0x2</value>
                  <description>Interrupt Source: Port 7.0 interrupt; Interrupt Flag: P7IFG0; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7IFG1</name>
                  <value>0x4</value>
                  <description>Interrupt Source: Port 7.1 interrupt; Interrupt Flag: P7IFG1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7IFG2</name>
                  <value>0x6</value>
                  <description>Interrupt Source: Port 7.2 interrupt; Interrupt Flag: P7IFG2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7IFG3</name>
                  <value>0x8</value>
                  <description>Interrupt Source: Port 7.3 interrupt; Interrupt Flag: P7IFG3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7IFG4</name>
                  <value>0xA</value>
                  <description>Interrupt Source: Port 7.4 interrupt; Interrupt Flag: P7IFG4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7IFG5</name>
                  <value>0xC</value>
                  <description>Interrupt Source: Port 7.5 interrupt; Interrupt Flag: P7IFG5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7IFG6</name>
                  <value>0xE</value>
                  <description>Interrupt Source: Port 7.6 interrupt; Interrupt Flag: P7IFG6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7IFG7</name>
                  <value>0x10</value>
                  <description>Interrupt Source: Port 7.7 interrupt; Interrupt Flag: P7IFG7; Interrupt Priority: Lowest</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P7IN</name>
          <addressOffset>0x60</addressOffset>
          <size>8</size>
          <description>Port 7 Input</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P7OUT</name>
          <addressOffset>0x62</addressOffset>
          <size>8</size>
          <description>Port 7 Output</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P7DIR</name>
          <addressOffset>0x64</addressOffset>
          <size>8</size>
          <description>Port 7 Direction</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P7REN</name>
          <addressOffset>0x66</addressOffset>
          <size>8</size>
          <description>Port 7 Resistor Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P7SEL0</name>
          <addressOffset>0x6A</addressOffset>
          <size>8</size>
          <description>Port 7 Select 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P7SEL1</name>
          <addressOffset>0x6C</addressOffset>
          <size>8</size>
          <description>Port 7 Select 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P7SELC</name>
          <addressOffset>0x76</addressOffset>
          <size>8</size>
          <description>Port 7 Complement Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P7IES</name>
          <addressOffset>0x78</addressOffset>
          <size>8</size>
          <description>Port 7 Interrupt Edge Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P7IE</name>
          <addressOffset>0x7A</addressOffset>
          <size>8</size>
          <description>Port 7 Interrupt Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P7IFG</name>
          <addressOffset>0x7C</addressOffset>
          <size>8</size>
          <description>Port 7 Interrupt Flag</description>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>P8</name>
      <baseAddress>0x0200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>P8IV</name>
          <addressOffset>0x7E</addressOffset>
          <size>16</size>
          <description>Port 8 Interrupt Vector Register</description>
          <fields>
            <field>
              <name>P8IV</name>
              <description>[4:0] Port 8 interrupt vector value</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8IFG0</name>
                  <value>0x2</value>
                  <description>Interrupt Source: Port 8.0 interrupt; Interrupt Flag: P8IFG0; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8IFG1</name>
                  <value>0x4</value>
                  <description>Interrupt Source: Port 8.1 interrupt; Interrupt Flag: P8IFG1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8IFG2</name>
                  <value>0x6</value>
                  <description>Interrupt Source: Port 8.2 interrupt; Interrupt Flag: P8IFG2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8IFG3</name>
                  <value>0x8</value>
                  <description>Interrupt Source: Port 8.3 interrupt; Interrupt Flag: P8IFG3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8IFG4</name>
                  <value>0xA</value>
                  <description>Interrupt Source: Port 8.4 interrupt; Interrupt Flag: P8IFG4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8IFG5</name>
                  <value>0xC</value>
                  <description>Interrupt Source: Port 8.5 interrupt; Interrupt Flag: P8IFG5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8IFG6</name>
                  <value>0xE</value>
                  <description>Interrupt Source: Port 8.6 interrupt; Interrupt Flag: P8IFG6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8IFG7</name>
                  <value>0x10</value>
                  <description>Interrupt Source: Port 8.7 interrupt; Interrupt Flag: P8IFG7; Interrupt Priority: Lowest</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P8IN</name>
          <addressOffset>0x61</addressOffset>
          <size>8</size>
          <description>Port 8 Input</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P8OUT</name>
          <addressOffset>0x63</addressOffset>
          <size>8</size>
          <description>Port 8 Output</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P8DIR</name>
          <addressOffset>0x65</addressOffset>
          <size>8</size>
          <description>Port 8 Direction</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P8REN</name>
          <addressOffset>0x67</addressOffset>
          <size>8</size>
          <description>Port 8 Resistor Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P8SEL0</name>
          <addressOffset>0x6B</addressOffset>
          <size>8</size>
          <description>Port 8 Select 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P8SEL1</name>
          <addressOffset>0x6D</addressOffset>
          <size>8</size>
          <description>Port 8 Select 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P8SELC</name>
          <addressOffset>0x77</addressOffset>
          <size>8</size>
          <description>Port 8 Complement Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P8IES</name>
          <addressOffset>0x79</addressOffset>
          <size>8</size>
          <description>Port 8 Interrupt Edge Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P8IE</name>
          <addressOffset>0x7B</addressOffset>
          <size>8</size>
          <description>Port 8 Interrupt Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P8IFG</name>
          <addressOffset>0x7D</addressOffset>
          <size>8</size>
          <description>Port 8 Interrupt Flag</description>
          <resetValue>0</resetValue>
        </register>
