lukasl93/msp430fr59941/MSP430FR59941.svd
        <register>
          <name>DMACTL1</name>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <description>DMA Control 1</description>
          <fields>
            <field>
              <name>DMA2TSEL</name>
              <description>[4:0] DMA trigger select</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA2TRIG0</name>
                  <value>0x0</value>
                  <description>DMA2TRIG0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG1</name>
                  <value>0x1</value>
                  <description>DMA2TRIG1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG2</name>
                  <value>0x2</value>
                  <description>DMA2TRIG2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG3</name>
                  <value>0x3</value>
                  <description>DMA2TRIG3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG4</name>
                  <value>0x4</value>
                  <description>DMA2TRIG4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG5</name>
                  <value>0x5</value>
                  <description>DMA2TRIG5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG6</name>
                  <value>0x6</value>
                  <description>DMA2TRIG6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG7</name>
                  <value>0x7</value>
                  <description>DMA2TRIG7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG8</name>
                  <value>0x8</value>
                  <description>DMA2TRIG8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG9</name>
                  <value>0x9</value>
                  <description>DMA2TRIG9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG10</name>
                  <value>0xA</value>
                  <description>DMA2TRIG10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG11</name>
                  <value>0xB</value>
                  <description>DMA2TRIG11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG12</name>
                  <value>0xC</value>
                  <description>DMA2TRIG12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG13</name>
                  <value>0xD</value>
                  <description>DMA2TRIG13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG14</name>
                  <value>0xE</value>
                  <description>DMA2TRIG14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG15</name>
                  <value>0xF</value>
                  <description>DMA2TRIG15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG16</name>
                  <value>0x10</value>
                  <description>DMA2TRIG16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG17</name>
                  <value>0x11</value>
                  <description>DMA2TRIG17</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG18</name>
                  <value>0x12</value>
                  <description>DMA2TRIG18</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG19</name>
                  <value>0x13</value>
                  <description>DMA2TRIG19</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG20</name>
                  <value>0x14</value>
                  <description>DMA2TRIG20</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG21</name>
                  <value>0x15</value>
                  <description>DMA2TRIG21</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG22</name>
                  <value>0x16</value>
                  <description>DMA2TRIG22</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG23</name>
                  <value>0x17</value>
                  <description>DMA2TRIG23</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG24</name>
                  <value>0x18</value>
                  <description>DMA2TRIG24</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG25</name>
                  <value>0x19</value>
                  <description>DMA2TRIG25</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG26</name>
                  <value>0x1A</value>
                  <description>DMA2TRIG26</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG27</name>
                  <value>0x1B</value>
                  <description>DMA2TRIG27</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG28</name>
                  <value>0x1C</value>
                  <description>DMA2TRIG28</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG29</name>
                  <value>0x1D</value>
                  <description>DMA2TRIG29</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG30</name>
                  <value>0x1E</value>
                  <description>DMA2TRIG30</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TRIG31</name>
                  <value>0x1F</value>
                  <description>DMA2TRIG31</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA3TSEL</name>
              <description>[12:8] DMA trigger select</description>
              <bitWidth>5</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA3TRIG0</name>
                  <value>0x0</value>
                  <description>DMA3TRIG0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG1</name>
                  <value>0x1</value>
                  <description>DMA3TRIG1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG2</name>
                  <value>0x2</value>
                  <description>DMA3TRIG2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG3</name>
                  <value>0x3</value>
                  <description>DMA3TRIG3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG4</name>
                  <value>0x4</value>
                  <description>DMA3TRIG4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG5</name>
                  <value>0x5</value>
                  <description>DMA3TRIG5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG6</name>
                  <value>0x6</value>
                  <description>DMA3TRIG6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG7</name>
                  <value>0x7</value>
                  <description>DMA3TRIG7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG8</name>
                  <value>0x8</value>
                  <description>DMA3TRIG8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG9</name>
                  <value>0x9</value>
                  <description>DMA3TRIG9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG10</name>
                  <value>0xA</value>
                  <description>DMA3TRIG10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG11</name>
                  <value>0xB</value>
                  <description>DMA3TRIG11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG12</name>
                  <value>0xC</value>
                  <description>DMA3TRIG12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG13</name>
                  <value>0xD</value>
                  <description>DMA3TRIG13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG14</name>
                  <value>0xE</value>
                  <description>DMA3TRIG14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG15</name>
                  <value>0xF</value>
                  <description>DMA3TRIG15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG16</name>
                  <value>0x10</value>
                  <description>DMA3TRIG16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG17</name>
                  <value>0x11</value>
                  <description>DMA3TRIG17</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG18</name>
                  <value>0x12</value>
                  <description>DMA3TRIG18</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG19</name>
                  <value>0x13</value>
                  <description>DMA3TRIG19</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG20</name>
                  <value>0x14</value>
                  <description>DMA3TRIG20</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG21</name>
                  <value>0x15</value>
                  <description>DMA3TRIG21</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG22</name>
                  <value>0x16</value>
                  <description>DMA3TRIG22</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG23</name>
                  <value>0x17</value>
                  <description>DMA3TRIG23</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG24</name>
                  <value>0x18</value>
                  <description>DMA3TRIG24</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG25</name>
                  <value>0x19</value>
                  <description>DMA3TRIG25</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG26</name>
                  <value>0x1A</value>
                  <description>DMA3TRIG26</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG27</name>
                  <value>0x1B</value>
                  <description>DMA3TRIG27</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG28</name>
                  <value>0x1C</value>
                  <description>DMA3TRIG28</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG29</name>
                  <value>0x1D</value>
                  <description>DMA3TRIG29</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG30</name>
                  <value>0x1E</value>
                  <description>DMA3TRIG30</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3TRIG31</name>
                  <value>0x1F</value>
                  <description>DMA3TRIG31</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
