lukasl93/msp430fr59941/MSP430FR59941.svd
        <register>
          <name>DMA0CTL</name>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <description>DMA Channel 0 Control</description>
          <fields>
            <field>
              <name>DMAREQ</name>
              <description>[0:0] DMA request</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAREQ_0</name>
                  <value>0x0</value>
                  <description>No DMA start</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAREQ_1</name>
                  <value>0x1</value>
                  <description>Start DMA</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAABORT</name>
              <description>[1:1] DMA abort</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAABORT_0</name>
                  <value>0x0</value>
                  <description>DMA transfer not interrupted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAABORT_1</name>
                  <value>0x1</value>
                  <description>DMA transfer interrupted by NMI</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAIE</name>
              <description>[2:2] DMA interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAIFG</name>
              <description>[3:3] DMA interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAEN</name>
              <description>[4:4] DMA enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMALEVEL</name>
              <description>[5:5] DMA level</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDGE</name>
                  <value>0x0</value>
                  <description>Edge sensitive (rising edge)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <value>0x1</value>
                  <description>Level sensitive (high level)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMASRCBYTE</name>
              <description>[6:6] DMA source byte</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WORD</name>
                  <value>0x0</value>
                  <description>Word</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE</name>
                  <value>0x1</value>
                  <description>Byte</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADSTBYTE</name>
              <description>[7:7] DMA destination byte</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WORD</name>
                  <value>0x0</value>
                  <description>Word</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE</name>
                  <value>0x1</value>
                  <description>Byte</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMASRCINCR</name>
              <description>[9:8] DMA source increment</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMASRCINCR_0</name>
                  <value>0x0</value>
                  <description>Source address is unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_1</name>
                  <value>0x1</value>
                  <description>Source address is unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_2</name>
                  <value>0x2</value>
                  <description>Source address is decremented</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_3</name>
                  <value>0x3</value>
                  <description>Source address is incremented</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADSTINCR</name>
              <description>[11:10] DMA destination increment</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMADSTINCR_0</name>
                  <value>0x0</value>
                  <description>Destination address is unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_1</name>
                  <value>0x1</value>
                  <description>Destination address is unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_2</name>
                  <value>0x2</value>
                  <description>Destination address is decremented</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_3</name>
                  <value>0x3</value>
                  <description>Destination address is incremented</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADT</name>
              <description>[14:12] DMA transfer mode</description>
              <bitWidth>3</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMADT_0</name>
                  <value>0x0</value>
                  <description>Single transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_1</name>
                  <value>0x1</value>
                  <description>Block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_2</name>
                  <value>0x2</value>
                  <description>Burst-block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_3</name>
                  <value>0x3</value>
                  <description>Burst-block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_4</name>
                  <value>0x4</value>
                  <description>Repeated single transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_5</name>
                  <value>0x5</value>
                  <description>Repeated block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_6</name>
                  <value>0x6</value>
                  <description>Repeated burst-block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_7</name>
                  <value>0x7</value>
                  <description>Repeated burst-block transfer</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA0SA</name>
          <addressOffset>0x12</addressOffset>
          <size>20</size>
          <description>DMA Channel 0 Source Address</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA0DA</name>
          <addressOffset>0x16</addressOffset>
          <size>20</size>
          <description>DMA Channel 0 Destination Address</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA0SZ</name>
          <addressOffset>0x1A</addressOffset>
          <size>16</size>
          <description>DMA Channel 0 Transfer Size</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA1CTL</name>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <description>DMA Channel 1 Control</description>
          <fields>
            <field>
              <name>DMAREQ</name>
              <description>[0:0] DMA request</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAREQ_0</name>
                  <value>0x0</value>
                  <description>No DMA start</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAREQ_1</name>
                  <value>0x1</value>
                  <description>Start DMA</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAABORT</name>
              <description>[1:1] DMA abort</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAABORT_0</name>
                  <value>0x0</value>
                  <description>DMA transfer not interrupted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAABORT_1</name>
                  <value>0x1</value>
                  <description>DMA transfer interrupted by NMI</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAIE</name>
              <description>[2:2] DMA interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAIFG</name>
              <description>[3:3] DMA interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAEN</name>
              <description>[4:4] DMA enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMALEVEL</name>
              <description>[5:5] DMA level</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDGE</name>
                  <value>0x0</value>
                  <description>Edge sensitive (rising edge)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <value>0x1</value>
                  <description>Level sensitive (high level)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMASRCBYTE</name>
              <description>[6:6] DMA source byte</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WORD</name>
                  <value>0x0</value>
                  <description>Word</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE</name>
                  <value>0x1</value>
                  <description>Byte</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADSTBYTE</name>
              <description>[7:7] DMA destination byte</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WORD</name>
                  <value>0x0</value>
                  <description>Word</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE</name>
                  <value>0x1</value>
                  <description>Byte</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMASRCINCR</name>
              <description>[9:8] DMA source increment</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMASRCINCR_0</name>
                  <value>0x0</value>
                  <description>Source address is unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_1</name>
                  <value>0x1</value>
                  <description>Source address is unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_2</name>
                  <value>0x2</value>
                  <description>Source address is decremented</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_3</name>
                  <value>0x3</value>
                  <description>Source address is incremented</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADSTINCR</name>
              <description>[11:10] DMA destination increment</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMADSTINCR_0</name>
                  <value>0x0</value>
                  <description>Destination address is unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_1</name>
                  <value>0x1</value>
                  <description>Destination address is unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_2</name>
                  <value>0x2</value>
                  <description>Destination address is decremented</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_3</name>
                  <value>0x3</value>
                  <description>Destination address is incremented</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADT</name>
              <description>[14:12] DMA transfer mode</description>
              <bitWidth>3</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMADT_0</name>
                  <value>0x0</value>
                  <description>Single transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_1</name>
                  <value>0x1</value>
                  <description>Block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_2</name>
                  <value>0x2</value>
                  <description>Burst-block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_3</name>
                  <value>0x3</value>
                  <description>Burst-block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_4</name>
                  <value>0x4</value>
                  <description>Repeated single transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_5</name>
                  <value>0x5</value>
                  <description>Repeated block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_6</name>
                  <value>0x6</value>
                  <description>Repeated burst-block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_7</name>
                  <value>0x7</value>
                  <description>Repeated burst-block transfer</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA1SA</name>
          <addressOffset>0x22</addressOffset>
          <size>20</size>
          <description>DMA Channel 1 Source Address</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA1DA</name>
          <addressOffset>0x26</addressOffset>
          <size>20</size>
          <description>DMA Channel 1 Destination Address</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA1SZ</name>
          <addressOffset>0x2A</addressOffset>
          <size>16</size>
          <description>DMA Channel 1 Transfer Size</description>
          <resetValue>0</resetValue>
        </register>
