lukasl93/msp430fr59941/MSP430FR59941.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LEA</name>
      <baseAddress>0x0A80</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LEACAP</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>LEA Capability Register</description>
          <fields>
            <field>
              <name>LEAMSIZ</name>
              <description>[3:0] LEA Code Memory Size. This register identifies the size of available code RAM.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEAMSIZ_0</name>
                  <value>0x0</value>
                  <description>no code RAM</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEAMSIZ_1</name>
                  <value>0x1</value>
                  <description>1KB Code RAM</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LEACNF0</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Configuration Register 0</description>
          <fields>
            <field>
              <name>LEASWRST</name>
              <description>[0:0] LEA module software restart. Setting this bit to one restarts the LEA module. As long this bit remains set to one the LEA is held in Restart. (The LEA accessible memory behaves as system RAM)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>LEAFTHOLD</name>
              <description>[1:1] Hold on faults and NMIs for all pending LEA operations transfers.This is for all system wide fault/NMI cases (for our first implementation we may just consider local LEA triggered fault cases)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEAFTHOLD_0</name>
                  <value>0x0</value>
                  <description>LEA transfers continue on faults/NMIs</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEAFTHOLD_1</name>
                  <value>0x1</value>
                  <description>LEA transfers enter HOLD on faults/NMIs</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEALPR</name>
              <description>[8:8] This bit defined if command execution shall be continued in LPM modes</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEALPR_0</name>
                  <value>0x0</value>
                  <description>LEA command execution stops in deep low power modes</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEALPR_1</name>
                  <value>0x1</value>
                  <description>LEA command execution continues in deep low power modes</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEAILPM</name>
              <description>[10:10] This bit defines if a "Command done interrupt" shall be triggered in LPM mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEAILPM_0</name>
                  <value>0x0</value>
                  <description>Interrupt of LEA is suppressed in LPM mode until AM is entered then the LEA interrupt is triggered as well</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEAILPM_1</name>
                  <value>0x1</value>
                  <description>Interrupt of LEA is always triggered on completion of an LEA command</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEAILB</name>
              <description>[11:11] LEA instruction loop buffer disable. Debugging function for LEA (leave it zero).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>LEATIMFLTE</name>
              <description>[13:13] LEA module timer fault enable.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEATIMFLT_0</name>
                  <value>0x0</value>
                  <description>LEA module timer timeout will not cause a fault indication</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATIMFLTE_1</name>
                  <value>0x1</value>
                  <description>LEA module timer timeout will cause a fault indication. LEA stops operation and enters "Ready-state".</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEACFLT</name>
              <description>[14:14] LEAHPCFLTE when hardware trigger available later Enable bit on peripheral mapped command faults and hardware triggered command faults.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEACFLT_0</name>
                  <value>0x0</value>
                  <description>LEAHPCFLT is disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEACFLT_1</name>
                  <value>0x1</value>
                  <description>LEAHPCFLT is enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEAMEMFLTE</name>
              <description>[15:15] Enable bit on memory faults.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEAMEMFLTE_0</name>
                  <value>0x0</value>
                  <description>LEA memory faults are disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEAMEMFLTE_1</name>
                  <value>0x1</value>
                  <description>LEA memory faults are enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEADONES</name>
              <description>[16:16] LEA done event indication and set flag. This bit indicated the done event for LEA. This bit can be set by writing a one to it. Writing a zero has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>LEAFREES</name>
              <description>[17:17] LEA free event indication and set flag. This bit indicated the free event for LEA. This bit can be set by writing a one to it. Writing a zero has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>LEATIMFLTS</name>
              <description>[21:21] LEA timeout fault indication and set flag; This bits indicates that timer timeout occurred. This fault may also be set by writing a one to it. Writing a zero has no effect.The corresponding terminal is connected to one of the UNMI inputs of the SYS module (A package option)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>LEACFLTS</name>
              <description>[22:22] LEAHPCFLTS when hardware trigger enabled later LEA command fault on peripheral interface or hardware triggered indication and set flag; This bits indicates that a command was invoked that is not implemented. This fault is also signaled to the SYS module as a "User-NMI" when enabled. Only one fault condition is signaled until this bit is cleared. Leaving this bit set will not cause any further faults. This fault may also be set by writing a one to it. Writing a zero has no effect.The corresponding terminal is connected to one of the UNMI inputs of the SYS module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEACFLTS_0</name>
                  <value>0x0</value>
                  <description>No command fault occurred since this bit was cleared</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEACFLTS_1</name>
                  <value>0x1</value>
                  <description>At least one command fault occurred since this bit was cleared</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEAMEMFLTS</name>
              <description>[23:23] LEA memory fault indication and set flag. This bit indicates that a fault in the memory VBUS interface occurred. The exact fault reason may be identified by checking LEACNF1. LEAWRSTAT and LEACNF1.LEARDSTAT.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEAMEMFLTS_0</name>
                  <value>0x0</value>
                  <description>No memory fault occurred since this bit was cleared</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEAMEMFLTS_1</name>
                  <value>0x1</value>
                  <description>At least one memory fault since this bit was cleared</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEATRST</name>
              <description>[24:24] LEA module timer reset. Setting this bit to one clears LEA module timer. This bit is self clearing and will always be read as zero.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>LEATEN</name>
              <description>[25:25] LEA timer enable; writing a one to this bit enables LEA timer operations.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>LEATISEL</name>
              <description>[31:28] LEA timer interval select. These bits select LEA timer interval. t#sub#CLK#/sub# = 1 / f#sub#CLK#/sub# f#sub#CLK#/sub# = MCLK</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEATISEL_0</name>
                  <value>0x0</value>
                  <description>Timeout period: 128 x t#sub#CLK#/sub# (16 us at 8 MHz); Interval period: 256 x t#sub#CLK#/sub# (32 us at 8 MHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATISEL_1</name>
                  <value>0x1</value>
                  <description>Timeout period: 256 x t#sub#CLK#/sub# (32 us at 8 MHz); Interval period: 512 x t#sub#CLK#/sub# (64 us at 8 MHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATISEL_2</name>
                  <value>0x2</value>
                  <description>Timeout period: 512 x t#sub#CLK#/sub# (64 us at 8 MHz); Interval period: 1024 x t#sub#CLK#/sub# (128 us at 8 MHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATISEL_3</name>
                  <value>0x3</value>
                  <description>Timeout period: 1024 x t#sub#CLK#/sub# (128 us at 8 MHz); Interval period: 2048 x t#sub#CLK#/sub# (256 us at 8 MHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATISEL_4</name>
                  <value>0x4</value>
                  <description>Timeout period: 2048 x t#sub#CLK#/sub# (256 us at 8 MHz); Interval period: 4096 x t#sub#CLK#/sub# (512 us at 8 MHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATISEL_5</name>
                  <value>0x5</value>
                  <description>Timeout period: 4096 x t#sub#CLK#/sub# (512 us at 8 MHz); Interval period: 8192 x t#sub#CLK#/sub# (1ms at 8 MHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATISEL_6</name>
                  <value>0x6</value>
                  <description>Timeout period: 8192 x t#sub#CLK#/sub# (1 ms at 8 MHz); Interval period: 16384 x t#sub#CLK#/sub# (2 ms at 8 MHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATISEL_7</name>
                  <value>0x7</value>
                  <description>Timeout period: 16384 x t#sub#CLK#/sub# (2 ms at 8 MHz); Interval period: 32768 x t#sub#CLK#/sub# (4 ms at 8 MHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATISEL_8</name>
                  <value>0x8</value>
                  <description>Timeout period: 32768 x t#sub#CLK#/sub# (4ms at 8 MHz); Interval period: 65536 x t#sub#CLK#/sub# (8 ms at 8 MHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATISEL_9</name>
                  <value>0x9</value>
                  <description>Timeout period: 65536 x t#sub#CLK#/sub# (8 ms at 8 MHz); Interval period: 131072 x t#sub#CLK#/sub# (16 ms at 8 MHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATISEL_10</name>
                  <value>0xA</value>
                  <description>Timeout period: 131072 x t#sub#CLK#/sub# (16 ms at 8 MHz); Interval period: 262144 x t#sub#CLK#/sub# (32 ms at 8 MHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATISEL_11</name>
                  <value>0xB</value>
                  <description>Timeout period: 524288 x t#sub#CLK#/sub# (65 ms at 8 MHz); Interval period: 1048576 x t#sub#CLK#/sub# (131 ms at 8 MHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATISEL_12</name>
                  <value>0xC</value>
                  <description>Timeout period: 1048576 x t#sub#CLK#/sub# (131 ms at 8 MHz); Interval period: 2097152 x t#sub#CLK#/sub# (262 ms at 8 MHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATISEL_13</name>
                  <value>0xD</value>
                  <description>Timeout period: 2097152 x t#sub#CLK#/sub# (262 ms at 8 MHz); Interval period: 4194304 x t#sub#CLK#/sub# (524 ms at 8 MHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATISEL_14</name>
                  <value>0xE</value>
                  <description>Timeout period: 4194304 x t#sub#CLK#/sub# (524 ms at 8 MHz); Interval period: 8388608 x t#sub#CLK#/sub# (1.05 s at 8 MHz)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATISEL_15</name>
                  <value>0xF</value>
                  <description>Timeout period: 8388608 x t#sub#CLK#/sub# (1.05 s at 8 MHz); Interval period: 16777216 x t#sub#CLK#/sub# (2.1 s at 8 MHz)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
