lukasl93/msp430fr59941/MSP430FR59941.svd
        <register>
          <name>LEACNF1</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Configuration Register 1</description>
          <fields>
            <field>
              <name>LEABUSY</name>
              <description>[0:0] This bit indicate if LEA is able to accept new Commands (SUSPEND is always accepted)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READY</name>
                  <value>0x0</value>
                  <description>LEA is in Ready can accept new commands</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <value>0x1</value>
                  <description>LEA is busy right now and cannot accept any commands</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEAMODE</name>
              <description>[7:4] These Bits indicate the actual operation mode LEA is in.  Other = Reserved</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <value>0x0</value>
                  <description>Off (implicit)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY</name>
                  <value>0x1</value>
                  <description>Ready</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNS</name>
                  <value>0x2</value>
                  <description>RunS (SUSPEND)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNR</name>
                  <value>0x3</value>
                  <description>RunR (RESUME)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNA</name>
                  <value>0x4</value>
                  <description>RunA (regular command operation )</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTIFY</name>
                  <value>0x5</value>
                  <description>Notify</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <value>0x6</value>
                  <description>Sleep</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNL</name>
                  <value>0x7</value>
                  <description>RunL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEAPWST</name>
              <description>[11:8] These bits indicate the current power consumption as a relative value. The value zero indicated only static operation (usually clock less). This register might be read out for statistical power estimation of an application. These bits are also reflected in J-STATE when debugging</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>LEAASST</name>
              <description>[15:12] These bits are used to store the internal state of the application specific processor (ASIP) inside the accelerator core. The specific meaning of those bit patterns is not shown in this document.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>LEADONEC</name>
              <description>[16:16] LEA done event indication and clear flag. This bit indicated the done event for LEA. This bit is cleared by writing a one to it. Writing a zero has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>LEAFREEC</name>
              <description>[17:17] LEA free event indication and clear flag. This bit indicated the free event for LEA. This bit is cleared by writing a one to it. Writing a zero has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>LEATIMFLTC</name>
              <description>[21:21] LEA timeout fault indication and clear flag; This bits indicates that a timer timeout occurred. This fault is cleared by writing a one to it. Writing a zero has no effect..</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>LEACFLTC</name>
              <description>[22:22] LEA command fault</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEACFLTC_0</name>
                  <value>0x0</value>
                  <description>No command fault occurred since this bit was cleared</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEACFLTC_1</name>
                  <value>0x1</value>
                  <description>At least one command fault occurred since this bit was cleared</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEAMEMFLTC</name>
              <description>[23:23] LEA memory fault indication and clear flag. This bit indicates that a fault in the memory VBUS interface occurred. The exact fault reason may be identified by checking LEAWRSTAT and LEARDSTAT. This fault is also signaled to the SYS-module as bus error when enabled (LEACNF0.LEAMEMFLTE=1). Only one fault condition is signaled until this bit is cleared. Leaving this bit set will not cause any further faults. This fault is cleared by writing a one to it. Writing a zero has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEAMEMFLTC_0</name>
                  <value>0x0</value>
                  <description>No memory fault occurred since this bit was cleared</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEAMEMFLTC_1</name>
                  <value>0x1</value>
                  <description>At least one memory fault since this bit was cleared</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEARDSTAT</name>
              <description>[27:24] Read Status. This bit field keeps the VBUS read status lines from the last bus error condition.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>LEAWRSTAT</name>
              <description>[31:28] Write Status. This bit field keeps the VBUS write status lines from the last bus error condition.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LEACNF2</name>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <description>Configuration Register 2</description>
          <fields>
            <field>
              <name>LEASPTR</name>
              <description>[15:0] LEA stack pointer value (byte units). 64 lower kB is physical limit for LEA application complexity</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LEAMB</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Memory Bottom Register</description>
          <fields>
            <field>
              <name>LEAMB</name>
              <description>[15:0] LEA memory bottom address boundary in byte address units</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LEAMT</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Memory Top Register</description>
          <fields>
            <field>
              <name>LEAMT</name>
              <description>[15:0] LEA memory top address boundary in byte address units</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LEACMA</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Code Memory Access Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LEACMCTL</name>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <description>Code Memory Control Register</description>
          <fields>
            <field>
              <name>LEACMAE</name>
              <description>[0:0] This bit controls access to LEA code memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEACMAE_0</name>
                  <value>0x0</value>
                  <description>Code memory access disabled. Accesses to LEA code memory are not possible. LEA does accept commands for execution. Reads to LEA code memory will return zeroes and writes are ignored.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEACMAE_1</name>
                  <value>0x1</value>
                  <description>Code memory access enabled. Accesses to LEA code memory are possible. LEA does not accept commands during this mode (command is ignored). Coprocessor interface accesses by the CPU cause a Coprocessor not available indication.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEAINC</name>
              <description>[2:2] This bit when set causes the code memory address port field LEACMAP to increment each time after an access to LEACMDP is performed.The decrement is by value two on 16B accesses on lower word of LEACMA.The decrement is by value two on 32B accesses on LEACMA.#b#Note:#/b# A double increment is performed when read modify write accesses are done on LEACMDP.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>LEADEC</name>
              <description>[3:3] This bit when set causes the code memory address port field LEACMAP to decrement each time after an access to LEACMDP is performed.The decrement is by value two on 16B accesses on lower word of LEACMA.The decrement is by value two on 32B accesses on LEACMA.#b#Note:#/b# A double decrement is performed when read modify write accesses are done on LEACMDP.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>LEACROFF</name>
              <description>[5:4] Control bits only available if LEA code RAM is available. Otherwise reserved. Reserved. Read back as 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEACROFF_0</name>
                  <value>0x0</value>
                  <description>Contents of LEA code RAM are retained in LPM3/LPM4.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEACROFF_1</name>
                  <value>0x1</value>
                  <description>Turns off the LEA code RAM in LPM3/LPM4, re-activates it on wake-up. All data of the code RAM is lost after wakeup from LPM3/LPM4. See the device specific data sheet for presence and size of Code RAM.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEACROFF_2</name>
                  <value>0x2</value>
                  <description>Turns off the code RAM entering LPM3/LPM4, the code RAM sector remains off after wake-up. All data of the code RAM is lost. See the device-specific data sheet for presence and size of Code RAM.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEACROFF_3</name>
                  <value>0x3</value>
                  <description>Reserved (Future: Turns off the code RAM immediately. All data of the Code RAM is lost. See the device-specific data sheet for presence and size of Code RAM.)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEACRACTION</name>
              <description>[6:6] Code RAM action</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>LEACMAP</name>
              <description>[31:16] LEA code memory address port. This bit field points to the memory location that is accessible via LEACMDP</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
