lukasl93/msp430fr59941/MSP430FR59941.svd
        <register>
          <name>LEAPMCB</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>PM Command Buffer Register</description>
          <fields>
            <field>
              <name>LEAITFLG</name>
              <description>[1:0] LEA instruction handshake synchronization type flag</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEAITFLG_0</name>
                  <value>0x0</value>
                  <description>LEA command without any further indication</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEAITFLG_1</name>
                  <value>0x1</value>
                  <description>LEA command with explicit result update</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEAITFLG_2</name>
                  <value>0x2</value>
                  <description>LEA command with interrupt upon completion</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEAITFLG_3</name>
                  <value>0x3</value>
                  <description>LEA command with interrupt and explicit result update</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEACMD</name>
              <description>[9:2] These bits represent the LEA command to be invoked. See also the command table</description>
              <bitWidth>8</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUSPEND</name>
                  <value>0x0</value>
                  <description>Suspends ongoing action an enters Ready</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESUME</name>
                  <value>0x2</value>
                  <description>Resumes an previously suspended command execution</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FFTCOMPLEXFIXEDSCALING</name>
                  <value>0x4</value>
                  <description>Complex FFT on 16 bit fractional numbers fix scaling</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIR</name>
                  <value>0x6</value>
                  <description>Real FIR on 16 bit fractional numbers</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POLYNOMIAL</name>
                  <value>0x8</value>
                  <description>Real vector polynomial calculations 16 args all fractional</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FFT</name>
                  <value>0xA</value>
                  <description>Real FFT-extension on 16 bit fractional numbers</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POLYNOMIALLONG</name>
                  <value>0xC</value>
                  <description>Real vector polynomial calculations 32 bit args all fractional</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYMATRIXROW</name>
                  <value>0xD</value>
                  <description>Real row oriented matrix multiply</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYMATRIX</name>
                  <value>0xF</value>
                  <description>Real matrix multiply 16 with 16 to 16 bit fractional</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDMATRIX</name>
                  <value>0x10</value>
                  <description>Real point wise matrix add of 16 and 16 to 16 bit number vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXMATRIX</name>
                  <value>0x11</value>
                  <description>Real maximum value and position of 16 bit matrices</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINMATRIX</name>
                  <value>0x12</value>
                  <description>Real minimum value and position of 16 bit matrices</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IIRBQ1</name>
                  <value>0x13</value>
                  <description>Real second order biquad using DF1 with 16 bit fractional</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAC</name>
                  <value>0x15</value>
                  <description>Real matrix MAC short with 16Bt to 16B fract</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEINTERLEAVEEVENEVEN</name>
                  <value>0x16</value>
                  <description>Split 16B vector even to even words</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEINTERLEAVEEVENODD</name>
                  <value>0x17</value>
                  <description>Split 16Bt vector even to odd words</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEINTERLEAVEODDEVEN</name>
                  <value>0x18</value>
                  <description>Split 16B vector odd to even words</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEINTERLEAVEODDODD</name>
                  <value>0x19</value>
                  <description>Split 16B vector odd to odd words</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MACCOMPLEXMATRIX</name>
                  <value>0x1A</value>
                  <description>Complex Dot Product</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MACCOMPLEXCONJUGATEMATRIX</name>
                  <value>0x1B</value>
                  <description>Complex conjugate Dot Product</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUBMATRIX</name>
                  <value>0x1C</value>
                  <description>Real point wise matrix Subtraction of 16 and 16 to 16 bit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYLONGMATRIX</name>
                  <value>0x1D</value>
                  <description>Real point wise matrix multiply 32 with 32 to 32 bit fractional</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYCOMPLEXMATRIX</name>
                  <value>0x1E</value>
                  <description>Complex point wise matrix multiply complex with complex</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDLONGMATRIX</name>
                  <value>0x1F</value>
                  <description>Real point wise matrix add of 32 and 32 to 32 bit number</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVELONGLIST</name>
                  <value>0x20</value>
                  <description>List move 32 to 32 bit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BITREVERSECOMPLEXEVEN</name>
                  <value>0x21</value>
                  <description>Complex bit reversal for 16 bit fractional numbers even</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BITREVERSECOMPLEXODD</name>
                  <value>0x22</value>
                  <description>Complex bit reversal for 16 bit fractional Numbers odd</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IIRBQ2EXTENDED</name>
                  <value>0x24</value>
                  <description>Real second order biquad using DF2 with 16 bit fractional, extended to include bias and intermediate state min/max</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FFTCOMPLEXLONG</name>
                  <value>0x27</value>
                  <description>Complex FFT on 32B bit fractional numbers, fix scaling</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FFTLONG</name>
                  <value>0x29</value>
                  <description>Real FFT-extension on 32 bit fractional numbers</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BITREVERSECOMPLEXLONGEVEN</name>
                  <value>0x2B</value>
                  <description>Complex bit reversal for 32 bit fractional numbers even</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BITREVERSECOMPLEXLONGODD</name>
                  <value>0x2D</value>
                  <description>Complex bit reversal for 16 bit fractional numbers odd</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POLYNOMIALSCALAR</name>
                  <value>0x2F</value>
                  <description>Scalar Polynomial for math on 32bit fractional</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FFTCOMPLEXAUTOSCALING</name>
                  <value>0x30</value>
                  <description>Complex FFT on 16B bit fractional numbers with auto scaling for enhanced accuracy</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRLONG</name>
                  <value>0x32</value>
                  <description>Real FIR on 32 bit fractional numbers</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MACLONGMATRIX</name>
                  <value>0x34</value>
                  <description>Real block MAC on 32B fractional numbers</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUBLONGMATRIX</name>
                  <value>0x35</value>
                  <description>Real point wise matrix Subtraction of 32 and 32 to 32 bit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXLONGMATRIX</name>
                  <value>0x36</value>
                  <description>Real maximum value and position of signed 32B matrices</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINLONGMATRIX</name>
                  <value>0x37</value>
                  <description>Real minimum value and position of signed 32B matrices</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCOMPLEX</name>
                  <value>0x38</value>
                  <description>Complex FIR on 16B fractional numbers</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXUNSIGNEDMATRIX</name>
                  <value>0x3A</value>
                  <description>Real maximum value and position of unsigned 16B matrices</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUNSIGNEDMATRIX</name>
                  <value>0x3B</value>
                  <description>Real minimum value and position of unsigned 32B matrices</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MACMATRIX</name>
                  <value>0x40</value>
                  <description>Real Matrix MAC on 16B fractional</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX</name>
                  <value>0x41</value>
                  <description>Vector maximum on 16B signed numbers</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN</name>
                  <value>0x42</value>
                  <description>Vector minimum on 16B signed numbers</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXUNSIGNED</name>
                  <value>0x43</value>
                  <description>Vector maximum on 16B unsigned numbers</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUNSIGNED</name>
                  <value>0x44</value>
                  <description>Vector minimum on 16B unsigned numbers</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXUNSIGNEDLONGMATRIX</name>
                  <value>0x45</value>
                  <description>Matrix maximum on 32B unsigned numbers</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUNSIGNEDLONGMATRIX</name>
                  <value>0x46</value>
                  <description>Matrix minimum on 32B unsigned numbers</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IIRBQ2</name>
                  <value>0x47</value>
                  <description>Real second order biquad using DF2 with 16 bit fractional</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCOMPLEXLONG</name>
                  <value>0x49</value>
                  <description>Complex FIR on 32B fractional numbers</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEINTERLEAVELONG</name>
                  <value>0x4B</value>
                  <description>Split Function on 32B Vectors/Matrices</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WINDOW</name>
                  <value>0x4C</value>
                  <description>In-place symmetrical window on 16B fractional numbers</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAC3</name>
                  <value>0x4D</value>
                  <description>Vector MAC at three points, real 16-bit with 32-bit result</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALEDMAC</name>
                  <value>0x4E</value>
                  <description>Scaled vector multiply and accumulate (MAC)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALEDFIR</name>
                  <value>0x4F</value>
                  <description>Scaled FIR, 16-bit real fractional numbers</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEACTX</name>
              <description>[31:20] Command context: This bit field may be set by the user together with invoking a command. This bit field is saved on SUSPEND; and restored from LEA Stack on RESUME. This bit field is used by SW to associate or synchronize LEA commands to a certain tasks and IDs.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LEAIFGSET</name>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <description>Interrupt Flag and Set Register</description>
          <fields>
            <field>
              <name>LEACOVLIS</name>
              <description>[0:0] LEA command overflow interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEACOVLIS_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEACOVLIS_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEATIS</name>
              <description>[1:1] LEA timer interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEATIS_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATIS_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEAOORIS</name>
              <description>[2:2] LEA out of address range interrupt flag.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEAOORIS_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEAOORIS_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEASDIIS</name>
              <description>[3:3] LEA scalar data inconsistency interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEASDIIS_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEASDIIS_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEAPMCMDIS</name>
              <description>[4:4] PMCMD as soon hardware trigger is avail. Peripheral memory triggered Command completed interrupt flag.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEAPMCMDIS_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEAPMCMDIS_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
