lukasl93/msp430fr59941/MSP430FR59941.svd
        <register>
          <name>LEAIE</name>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <description>Interrupt Enable Register</description>
          <fields>
            <field>
              <name>LEACOVLIE</name>
              <description>[0:0] LEA command overflow interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEACOVLIE_0</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEACOVLIE_1</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEATIE</name>
              <description>[1:1] LEA timer event interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEATIE_0</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATIE_1</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEAOORIE</name>
              <description>[2:2] LEA out of address range interrupt enable.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEAOORIE_0</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEAOORIE_1</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEASDIIE</name>
              <description>[3:3] LEA scalar data inconsistency interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEASDIIE_0</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEASDIIE_1</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEAPMCMDIE</name>
              <description>[4:4] PMCMD as soon hardware trigger is avail. Peripheral memory triggered Command completed interrupt enable.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEAPMCMDIE_0</name>
                  <value>0x0</value>
                  <description>Interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEAPMCMDIE_1</name>
                  <value>0x1</value>
                  <description>Interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LEAIFG</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>Interrupt Flag and Clear Register</description>
          <fields>
            <field>
              <name>LEACOVLIFG</name>
              <description>[0:0] LEA command overflow interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEACOVLIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEACOVLIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEATIFG</name>
              <description>[1:1] LEA timer interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEATIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEAOORIFG</name>
              <description>[2:2] LEA out of address range interrupt flag.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEAOORIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEAOORIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEASDIIFG</name>
              <description>[3:3] LEA scalar data inconsistency interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEASDIIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEASDIIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEAPMCMDIFG</name>
              <description>[4:4] PMCMD when hardware trigger is available. Peripheral memory triggered Command completed interrupt flag.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEAPMCMDIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEAPMCMDIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LEAIV</name>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <description>Interrupt Vector Register</description>
          <fields>
            <field>
              <name>LEAIV</name>
              <description>[7:0] LEA interrupt vector. This is a generated value that can be used as address offset for fast interrupt service routine handling. Reading this register clears the highest pending LEA interrupt (displaying this register with an IDE does not affect its content). Writing to this register clears al pending interrupt flags.This value is always aligned to a 20 bit address offset boundary</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COVLIFG</name>
                  <value>0x2</value>
                  <description>LEA command overflow</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIFG</name>
                  <value>0x4</value>
                  <description>LEA timer interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OORIFG</name>
                  <value>0x6</value>
                  <description>LEA out of range interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIIFG</name>
                  <value>0x8</value>
                  <description>LEA scalar data inconsistency</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMCMDIFG</name>
                  <value>0xA</value>
                  <description>PMCMD complete interrupt</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
