lukasl93/msp430fr59941/MSP430FR59941.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MPU</name>
      <baseAddress>0x05A0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MPUCTL0</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>Memory Protection Unit Control 0</description>
          <fields>
            <field>
              <name>MPUENA</name>
              <description>[0:0] MPU Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPULOCK</name>
              <description>[1:1] MPU Lock</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPEN</name>
                  <value>0x0</value>
                  <description>Open</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK</name>
                  <value>0x1</value>
                  <description>Locked</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEGIE</name>
              <description>[4:4] Enable NMI Event if a Segment violation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Segment violation interrupt disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Segment violation interrupt enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUPW</name>
              <description>[15:8] MPU Password</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPUCTL1</name>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <description>Memory Protection Unit Control 1</description>
          <fields>
            <field>
              <name>MPUSEG1IFG</name>
              <description>[0:0] Main Memory Segment 1 Violation Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPUSEG1IFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUSEG1IFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEG2IFG</name>
              <description>[1:1] Main Memory Segment 2 Violation Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPUSEG2IFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUSEG2IFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEG3IFG</name>
              <description>[2:2] Main Memory Segment 3 Violation Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPUSEG1IFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUSEG1IFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEGIIFG</name>
              <description>[3:3] User Information Memory Violation Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPUSEGIIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUSEGIIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEGIPIFG</name>
              <description>[4:4] IP Encapsulation Access Violation Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPUSEG1IFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUSEG1IFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPUSEGB2</name>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <description>Memory Protection Unit Segmentation Border 2 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPUSEGB1</name>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <description>Memory Protection Unit Segmentation Border 1 Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPUSAM</name>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <description>Memory Protection Unit Segmentation Access Management Register</description>
          <fields>
            <field>
              <name>MPUSEG1RE</name>
              <description>[0:0] MPU Main Memory Segment 1 Read Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Read on Main Memory Segment 1 causes a violation if MPUSEG1WE = MPUSEG1XE = 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Read on Main Memory Segment 1 is allowed</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEG1WE</name>
              <description>[1:1] MPU Main Memory Segment 1 Write Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Write on Main Memory Segment 1 causes a violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Write on Main Memory Segment 1 is allowed</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEG1XE</name>
              <description>[2:2] MPU Main Memory Segment 1 Execute Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Execute code on Main Memory Segment 1 causes a violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Execute code on Main Memory Segment 1 is allowed</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEG1VS</name>
              <description>[3:3] MPU Main Memory Segment 1 Violation Select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPUSEG1VS_0</name>
                  <value>0x0</value>
                  <description>Violation in Main Memory Segment 1 asserts the MPUSEG1IFG bit and executes a SNMI if enabled by MPUSEGIE = 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUSEG1VS_1</name>
                  <value>0x1</value>
                  <description>Violation in Main Memory Segment 1 asserts the MPUSEG1IFG bit and executes a PUC</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEG2RE</name>
              <description>[4:4] MPU Main Memory Segment 2 Read Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Read on Main Memory Segment 2 causes a violation if MPUSEG2WE = MPUSEG2XE = 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Read on Main Memory Segment 2 is allowed</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEG2WE</name>
              <description>[5:5] MPU Main Memory Segment 2 Write Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Write on Main Memory Segment 2 causes a violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Write on Main Memory Segment 2 is allowed</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEG2XE</name>
              <description>[6:6] MPU Main Memory Segment 2 Execute Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Execute code on Main Memory Segment 2 causes a violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Execute code on Main Memory Segment 2 is allowed</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEG2VS</name>
              <description>[7:7] MPU Main Memory Segment 2 Violation Select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPUSEG2VS_0</name>
                  <value>0x0</value>
                  <description>Violation in Main Memory Segment 2 asserts the MPUSEG2IFG bit and executes a SNMI if enabled by MPUSEGIE = 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUSEG2VS_1</name>
                  <value>0x1</value>
                  <description>Violation in Main Memory Segment 2 asserts the MPUSEG2IFG bit and executes a PUC</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEG3RE</name>
              <description>[8:8] MPU Main Memory Segment 3 Read Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Read on Main Memory Segment 3 causes a violation if MPUSEG3WE = MPUSEG3XE = 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Read on Main Memory Segment 3 is allowed</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEG3WE</name>
              <description>[9:9] MPU Main Memory Segment 3 Write Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Write on Main Memory Segment 3 causes a violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Write on Main Memory Segment 3 is allowed</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEG3XE</name>
              <description>[10:10] MPU Main Memory Segment 3 Execute Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Execute code on Main Memory Segment 3 causes a violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Execute code on Main Memory Segment 3 is allowed</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEG3VS</name>
              <description>[11:11] MPU Main Memory Segment 3 Violation Select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPUSEG3VS_0</name>
                  <value>0x0</value>
                  <description>Violation in Main Memory Segment 3 asserts the MPUSEG3IFG bit and executes a SNMI if enabled by MPUSEGIE = 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUSEG3VS_1</name>
                  <value>0x1</value>
                  <description>Violation in Main Memory Segment 3 asserts the MPUSEG3IFG bit and executes a PUC</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEGIRE</name>
              <description>[12:12] MPU User Information Memory Segment Read Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Read on User Information Memory causes a violation if MPUSEGIWE=MPUSEGIXE=0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Read on User Information Memory is allowed</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEGIWE</name>
              <description>[13:13] MPU User Information Memory Segment Write Enable.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Write on User Information Memory causes a violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Write on User Information Memory is allowed</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEGIXE</name>
              <description>[14:14] MPU User Information Memory Segment Execute Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Execute code on User Information Memory causes a violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Execute code on User Information Memory is allowed</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUSEGIVS</name>
              <description>[15:15] MPU User Information Memory Segment Violation Select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPUSEGIVS_0</name>
                  <value>0x0</value>
                  <description>Violation in User Information Memory asserts the MPUSEGIIFG bit and executes a SNMI if enabled by MPUSEGIE =1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUSEGIVS_1</name>
                  <value>0x1</value>
                  <description>Violation in User Information Memory asserts the MPUSEGIIFG bit and executes a PUC</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPUIPC0</name>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <description>Memory Protection Unit IP Control 0 Register</description>
          <fields>
            <field>
              <name>MPUIPVS</name>
              <description>[5:5] MPU IP Encapsulation segment Violation Select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPUIPVS_0</name>
                  <value>0x0</value>
                  <description>Violation in Main Memory Segment 1 asserts the MPUSEGPIFG bit and executes a SNMI if enabled by MPUSEGIE = 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUIPVS_1</name>
                  <value>0x1</value>
                  <description>Violation in Main Memory Segment 1 asserts the MPUSEGPIFG bit and executes a PUC</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUIPENA</name>
              <description>[6:6] MPU IP Encapsulation Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>Disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>Enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPUIPLOCK</name>
              <description>[7:7] MPU IP Encapsulation Lock</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPEN</name>
                  <value>0x0</value>
                  <description>Open</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK</name>
                  <value>0x1</value>
                  <description>Locked</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
