lukasl93/msp430fr59941/MSP430FR59941.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>REF_A</name>
      <baseAddress>0x01B0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REFCTL0</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>REF Control Register 0</description>
          <fields>
            <field>
              <name>REFON</name>
              <description>[0:0] Reference enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFON_0</name>
                  <value>0x0</value>
                  <description>Disables reference if no other reference requests are pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFON_1</name>
                  <value>0x1</value>
                  <description>Enables reference in static mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFOUT</name>
              <description>[1:1] Reference output buffer</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFOUT_0</name>
                  <value>0x0</value>
                  <description>Reference output not available externally</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFOUT_1</name>
                  <value>0x1</value>
                  <description>Reference output available externally. If ADC14REFBURST = 0, output is available continuously. If ADC14REFBURST = 1, output is available only during an ADC14 conversion.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFTCOFF</name>
              <description>[3:3] Temperature sensor disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFTCOFF_0</name>
                  <value>0x0</value>
                  <description>Temperature sensor enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFTCOFF_1</name>
                  <value>0x1</value>
                  <description>Temperature sensor disabled to save power</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFVSEL</name>
              <description>[5:4] Reference voltage level select</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFVSEL_0</name>
                  <value>0x0</value>
                  <description>1.2 V available when reference requested or REFON = 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFVSEL_1</name>
                  <value>0x1</value>
                  <description>2.0 V available when reference requested or REFON = 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFVSEL_2</name>
                  <value>0x2</value>
                  <description>2.5 V available when reference requested or REFON = 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFVSEL_3</name>
                  <value>0x3</value>
                  <description>2.5 V available when reference requested or REFON = 1</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFGENOT</name>
              <description>[6:6] Reference generator one-time trigger</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFGENOT_0</name>
                  <value>0x0</value>
                  <description>No trigger</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFGENOT_1</name>
                  <value>0x1</value>
                  <description>Generation of the reference voltage is started by writing 1 or by a hardware trigger</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFBGOT</name>
              <description>[7:7] Bandgap and bandgap buffer one-time trigger</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFBGOT_0</name>
                  <value>0x0</value>
                  <description>No trigger</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFBGOT_1</name>
                  <value>0x1</value>
                  <description>Generation of the bandgap voltage is started by writing 1 or by a hardware trigger</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFGENACT</name>
              <description>[8:8] Reference generator active</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFGENACT_0</name>
                  <value>0x0</value>
                  <description>Reference generator not active</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFGENACT_1</name>
                  <value>0x1</value>
                  <description>Reference generator active</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFBGACT</name>
              <description>[9:9] Reference bandgap active</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFBGACT_0</name>
                  <value>0x0</value>
                  <description>Reference bandgap buffer not active</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFBGACT_1</name>
                  <value>0x1</value>
                  <description>Reference bandgap buffer active</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFGENBUSY</name>
              <description>[10:10] Reference generator busy</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFGENBUSY_0</name>
                  <value>0x0</value>
                  <description>Reference generator not busy</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFGENBUSY_1</name>
                  <value>0x1</value>
                  <description>Reference generator busy</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BGMODE</name>
              <description>[11:11] Bandgap mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BGMODE_0</name>
                  <value>0x0</value>
                  <description>Static mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGMODE_1</name>
                  <value>0x1</value>
                  <description>Sampled mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFGENRDY</name>
              <description>[12:12] Variable reference voltage ready status</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFGENRDY_0</name>
                  <value>0x0</value>
                  <description>Reference voltage output is not ready to be used</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFGENRDY_1</name>
                  <value>0x1</value>
                  <description>Reference voltage output is ready to be used</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFBGRDY</name>
              <description>[13:13] Buffered bandgap voltage ready status</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFBGRDY_0</name>
                  <value>0x0</value>
                  <description>Buffered bandgap voltage is not ready to be used</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFBGRDY_1</name>
                  <value>0x1</value>
                  <description>Buffered bandgap voltage is ready to be used</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
