lukasl93/msp430fr59941/MSP430FR59941.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYS</name>
      <baseAddress>0x0180</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SYSCTL</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <description>System Control</description>
          <fields>
            <field>
              <name>SYSRIVECT</name>
              <description>[0:0] RAM-based interrupt vectors</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRAM</name>
                  <value>0x0</value>
                  <description>Interrupt vectors generated with end address TOP of lower 64K FRAM FFFFh</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM</name>
                  <value>0x1</value>
                  <description>Interrupt vectors generated with end address TOP of RAM, when RAM available</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSPMMPE</name>
              <description>[2:2] PMM access protect</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSPMMPE_0</name>
                  <value>0x0</value>
                  <description>Access from anywhere in memory</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSPMMPE_1</name>
                  <value>0x1</value>
                  <description>Access only from the BSL segments</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSBSLIND</name>
              <description>[4:4] BSL entry indication</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSBSLIND_0</name>
                  <value>0x0</value>
                  <description>No BSL entry sequence detected</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSBSLIND_1</name>
                  <value>0x1</value>
                  <description>BSL entry sequence detected</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSJTAGPIN</name>
              <description>[5:5] Dedicated JTAG pins enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHARED</name>
                  <value>0x0</value>
                  <description>Shared JTAG pins (JTAG mode selectable using SBW sequence)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEDICATED</name>
                  <value>0x1</value>
                  <description>Dedicated JTAG pins (explicit 4-wire JTAG mode selection)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSJMBC</name>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <description>JTAG Mailbox Control</description>
          <fields>
            <field>
              <name>JMBIN0FG</name>
              <description>[0:0] Incoming JTAG Mailbox 0 flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JMBIN0FG_0</name>
                  <value>0x0</value>
                  <description>JMBI0 has no new data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JMBIN0FG_1</name>
                  <value>0x1</value>
                  <description>JMBI0 has new data available</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JMBIN1FG</name>
              <description>[1:1] Incoming JTAG Mailbox 1 flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JMBIN1FG_0</name>
                  <value>0x0</value>
                  <description>JMBI1 has no new data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JMBIN1FG_1</name>
                  <value>0x1</value>
                  <description>JMBI1 has new data available</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JMBOUT0FG</name>
              <description>[2:2] Outgoing JTAG Mailbox 0 flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JMBOUT0FG_0</name>
                  <value>0x0</value>
                  <description>JMBO0 is not ready to receive new data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JMBOUT0FG_1</name>
                  <value>0x1</value>
                  <description>JMBO0 is ready to receive new data</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JMBOUT1FG</name>
              <description>[3:3] Outgoing JTAG Mailbox 1 flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JMBOUT1FG_0</name>
                  <value>0x0</value>
                  <description>JMBO1 is not ready to receive new data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JMBOUT1FG_1</name>
                  <value>0x1</value>
                  <description>JMBO1 is ready to receive new data</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JMBMODE</name>
              <description>[4:4] Operation mode of JMB</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>16BIT</name>
                  <value>0x0</value>
                  <description>16-bit transfers using JMBO0 and JMBI0 only</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32BIT</name>
                  <value>0x1</value>
                  <description>32-bit transfers using JMBO0 with JMBO1 and JMBI0 with JMBI1</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JMBCLR0OFF</name>
              <description>[6:6] Incoming JTAG Mailbox 0 flag auto-clear disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JMBCLR0OFF_0</name>
                  <value>0x0</value>
                  <description>JMBIN0FG cleared on read of JMB0IN register</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JMBCLR0OFF_1</name>
                  <value>0x1</value>
                  <description>JMBIN0FG cleared by software</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JMBCLR1OFF</name>
              <description>[7:7] Incoming JTAG Mailbox 1 flag auto-clear disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JMBCLR1OFF_0</name>
                  <value>0x0</value>
                  <description>JMBIN1FG cleared on read of JMB1IN register</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JMBCLR1OFF_1</name>
                  <value>0x1</value>
                  <description>JMBIN1FG cleared by software</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSJMBI0</name>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <description>JTAG Mailbox Input</description>
          <fields>
            <field>
              <name>MSGLO</name>
              <description>[7:0] JTAG mailbox incoming message low byte</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>MSGHI</name>
              <description>[15:8] JTAG mailbox incoming message high byte</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSJMBI1</name>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <description>JTAG Mailbox Input</description>
          <fields>
            <field>
              <name>MSGLO</name>
              <description>[7:0] JTAG mailbox incoming message low byte</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>MSGHI</name>
              <description>[15:8] JTAG mailbox incoming message high byte</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSJMBO0</name>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <description>JTAG Mailbox Output</description>
          <fields>
            <field>
              <name>MSGLO</name>
              <description>[7:0] JTAG mailbox outgoing message low byte</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>MSGHI</name>
              <description>[15:8] JTAG mailbox outgoing message high byte</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSJMBO1</name>
          <addressOffset>0xE</addressOffset>
          <size>16</size>
          <description>JTAG Mailbox Output</description>
          <fields>
            <field>
              <name>MSGLO</name>
              <description>[7:0] JTAG mailbox outgoing message low byte</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>MSGHI</name>
              <description>[15:8] JTAG mailbox outgoing message high byte</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSUNIV</name>
          <addressOffset>0x1A</addressOffset>
          <size>16</size>
          <description>User NMI Vector Generator</description>
          <fields>
            <field>
              <name>SYSUNIV</name>
              <description>[15:0] User NMI vector</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NMIIFG</name>
                  <value>0x2</value>
                  <description>NMIIFG NMI pin</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFIFG</name>
                  <value>0x4</value>
                  <description>OFIFG oscillator fault</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSSNIV</name>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <description>System NMI Vector Generator</description>
          <fields>
            <field>
              <name>SYSSNIV</name>
              <description>[15:0] System NMI vector</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSSNIV_2</name>
                  <value>0x2</value>
                  <description>Reserved</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UBDIFG</name>
                  <value>0x4</value>
                  <description>Uncorrectable FRAM bit error detection</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCTEIFG</name>
                  <value>0x6</value>
                  <description>FRAM Access Time Error</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUSEGPIFG</name>
                  <value>0x8</value>
                  <description>MPUSEGPIFG encapsulated IP memory segment violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUSEGIIFG</name>
                  <value>0xA</value>
                  <description>MPUSEGIIFG information memory segment violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUSEG1IFG</name>
                  <value>0xC</value>
                  <description>MPUSEG1IFG segment 1 memory violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUSEG2IFG</name>
                  <value>0xE</value>
                  <description>MPUSEG2IFG segment 2 memory violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUSEG3IFG</name>
                  <value>0x10</value>
                  <description>MPUSEG3IFG segment 3 memory violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VMAIFG</name>
                  <value>0x12</value>
                  <description>VMAIFG Vacant memory access</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JMBINIFG</name>
                  <value>0x14</value>
                  <description>JMBINIFG JTAG mailbox input</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JMBOUTIFG</name>
                  <value>0x16</value>
                  <description>JMBOUTIFG JTAG mailbox output</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBDIFG</name>
                  <value>0x18</value>
                  <description>Correctable FRAM bit error detection</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WPROT</name>
                  <value>0x1A</value>
                  <description>FRAM write protection detection</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEATO</name>
                  <value>0x1C</value>
                  <description>LEA time-out fault</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEACMD</name>
                  <value>0x1E</value>
                  <description>LEA command fault</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSRSTIV</name>
          <addressOffset>0x1E</addressOffset>
          <size>16</size>
          <description>Reset Vector Generator</description>
          <fields>
            <field>
              <name>SYSRSTIV</name>
              <description>[15:0] Reset interrupt vector</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOR</name>
                  <value>0x2</value>
                  <description>Brownout</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSTNMI</name>
                  <value>0x4</value>
                  <description>RSTIFG RST/NMI</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMSWBOR</name>
                  <value>0x6</value>
                  <description>PMMSWBOR software BOR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM5WU</name>
                  <value>0x8</value>
                  <description>LPMx.5 wakeup</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECYV</name>
                  <value>0xA</value>
                  <description>Security violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRSTIV_12</name>
                  <value>0xC</value>
                  <description>Reserved</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSHIFG</name>
                  <value>0xE</value>
                  <description>SVSHIFG SVSH event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRSTIV_16</name>
                  <value>0x10</value>
                  <description>Reserved</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRSTIV_18</name>
                  <value>0x12</value>
                  <description>Reserved</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMSWPOR</name>
                  <value>0x14</value>
                  <description>PMMSWPOR software POR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIFG</name>
                  <value>0x16</value>
                  <description>WDTIFG watchdog timeout</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTPW</name>
                  <value>0x18</value>
                  <description>WDTPW watchdog password violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRCTLPW</name>
                  <value>0x1A</value>
                  <description>FRCTLPW password violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UBDIFG</name>
                  <value>0x1C</value>
                  <description>Uncorrectable FRAM bit error detection</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERF</name>
                  <value>0x1E</value>
                  <description>Peripheral area fetch</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMPW</name>
                  <value>0x20</value>
                  <description>PMM password violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUPW</name>
                  <value>0x22</value>
                  <description>MPU password violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSPW</name>
                  <value>0x24</value>
                  <description>CS password violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUSEGPIFG</name>
                  <value>0x26</value>
                  <description>MPUSEGPIFG encapsulated IP memory segment violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUSEGIIFG</name>
                  <value>0x28</value>
                  <description>MPUSEGIIFG information memory segment violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUSEG1IFG</name>
                  <value>0x2A</value>
                  <description>MPUSEG1IFG segment 1 memory violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUSEG2IFG</name>
                  <value>0x2C</value>
                  <description>MPUSEG2IFG segment 2 memory violation</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPUSEG3IFG</name>
                  <value>0x2E</value>
                  <description>MPUSEG3IFG segment 3 memory violation</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
