lukasl93/msp430fr59941/MSP430FR59941.svd
        <register>
          <name>UCB1IFG</name>
          <addressOffset>0x2C</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx Interrupt Flag Register</description>
          <fields>
            <field>
              <name>UCRXIFG0</name>
              <description>[0:0] eUSCI_B receive interrupt flag 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCRXIFG0_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG0_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCTXIFG0</name>
              <description>[1:1] eUSCI_B transmit interrupt flag 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCTXIFG0_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG0_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSTTIFG</name>
              <description>[2:2] START condition interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSTTIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSTTIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSTPIFG</name>
              <description>[3:3] STOP condition interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSTPIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSTPIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCALIFG</name>
              <description>[4:4] Arbitration lost interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCALIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCALIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCNACKIFG</name>
              <description>[5:5] Not-acknowledge received interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCNACKIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCNACKIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCBCNTIFG</name>
              <description>[6:6] Byte counter interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCBCNTIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBCNTIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCCLTOIFG</name>
              <description>[7:7] Clock low timeout interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCCLTOIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCCLTOIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCRXIFG1</name>
              <description>[8:8] eUSCI_B receive interrupt flag 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCRXIFG1_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG1_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCTXIFG1</name>
              <description>[9:9] eUSCI_B transmit interrupt flag 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCTXIFG1_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG1_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCRXIFG2</name>
              <description>[10:10] eUSCI_B receive interrupt flag 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCRXIFG2_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG2_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCTXIFG2</name>
              <description>[11:11] eUSCI_B transmit interrupt flag 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCTXIFG2_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG2_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCRXIFG3</name>
              <description>[12:12] eUSCI_B receive interrupt flag 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCRXIFG3_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG3_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCTXIFG3</name>
              <description>[13:13] eUSCI_B transmit interrupt flag 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCTXIFG3_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG3_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCBIT9IFG</name>
              <description>[14:14] Bit position 9 interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCBIT9IFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBIT9IFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB1IFG_SPI</name>
          <addressOffset>0x2C</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx Interrupt Flag Register</description>
          <fields>
            <field>
              <name>UCRXIFG</name>
              <description>[0:0] Receive interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCRXIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCTXIFG</name>
              <description>[1:1] Transmit interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCTXIFG_0</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG_1</name>
                  <value>0x1</value>
                  <description>Interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB1IV</name>
          <addressOffset>0x2E</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx Interrupt Vector Register</description>
          <fields>
            <field>
              <name>UCIV</name>
              <description>[15:0] eUSCI_B interrupt vector value</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCALIFG</name>
                  <value>0x2</value>
                  <description>Interrupt Source: Arbitration lost; Interrupt Flag: UCALIFG; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCNACKIFG</name>
                  <value>0x4</value>
                  <description>Interrupt Source: Not acknowledgment; Interrupt Flag: UCNACKIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSTTIFG</name>
                  <value>0x6</value>
                  <description>Interrupt Source: Start condition received; Interrupt Flag: UCSTTIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSTPIFG</name>
                  <value>0x8</value>
                  <description>Interrupt Source: Stop condition received; Interrupt Flag: UCSTPIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG3</name>
                  <value>0xA</value>
                  <description>Interrupt Source: Slave 3 Data received; Interrupt Flag: UCRXIFG3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG3</name>
                  <value>0xC</value>
                  <description>Interrupt Source: Slave 3 Transmit buffer empty; Interrupt Flag: UCTXIFG3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG2</name>
                  <value>0xE</value>
                  <description>Interrupt Source: Slave 2 Data received; Interrupt Flag: UCRXIFG2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG2</name>
                  <value>0x10</value>
                  <description>Interrupt Source: Slave 2 Transmit buffer empty; Interrupt Flag: UCTXIFG2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG1</name>
                  <value>0x12</value>
                  <description>Interrupt Source: Slave 1 Data received; Interrupt Flag: UCRXIFG1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG1</name>
                  <value>0x14</value>
                  <description>Interrupt Source: Slave 1 Transmit buffer empty; Interrupt Flag: UCTXIFG1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG0</name>
                  <value>0x16</value>
                  <description>Interrupt Source: Data received; Interrupt Flag: UCRXIFG0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG0</name>
                  <value>0x18</value>
                  <description>Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIFG0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBCNTIFG</name>
                  <value>0x1A</value>
                  <description>Interrupt Source: Byte counter zero; Interrupt Flag: UCBCNTIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCCLTOIFG</name>
                  <value>0x1C</value>
                  <description>Interrupt Source: Clock low timeout; Interrupt Flag: UCCLTOIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBIT9IFG</name>
                  <value>0x1E</value>
                  <description>Interrupt Source: Nineth bit position; Interrupt Flag: UCBIT9IFG; Priority: Lowest</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB1IV_SPI</name>
          <addressOffset>0x2E</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx Interrupt Vector Register</description>
          <fields>
            <field>
              <name>UCIV</name>
              <description>[15:0] eUSCI_B interrupt vector value</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0x0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXIFG</name>
                  <value>0x2</value>
                  <description>Interrupt Source: Data received; Interrupt Flag: UCRXIFG; Interrupt Priority: Highest</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXIFG</name>
                  <value>0x4</value>
                  <description>Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIFG; Interrupt Priority: Lowest</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
