lukasl93/msp430fr59941/MSP430FR59941.svd
        <register>
          <name>UCB2CTLW1</name>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx Control Word Register 1</description>
          <fields>
            <field>
              <name>UCGLIT</name>
              <description>[1:0] Deglitch time</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCGLIT_0</name>
                  <value>0x0</value>
                  <description>50 ns</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCGLIT_1</name>
                  <value>0x1</value>
                  <description>25 ns</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCGLIT_2</name>
                  <value>0x2</value>
                  <description>12.5 ns</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCGLIT_3</name>
                  <value>0x3</value>
                  <description>6.25 ns</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCASTP</name>
              <description>[3:2] Automatic STOP condition generation</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCASTP_0</name>
                  <value>0x0</value>
                  <description>No automatic STOP generation. The STOP condition is generated after the user sets the UCTXSTP bit. The value in UCBxTBCNT is a don't care.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCASTP_1</name>
                  <value>0x1</value>
                  <description>UCBCNTIFG is set with the byte counter reaches the threshold defined in UCBxTBCNT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCASTP_2</name>
                  <value>0x2</value>
                  <description>A STOP condition is generated automatically after the byte counter value reached UCBxTBCNT. UCBCNTIFG is set with the byte counter reaching the threshold</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSWACK</name>
              <description>[4:4] SW or HW ACK control</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSWACK_0</name>
                  <value>0x0</value>
                  <description>The address acknowledge of the slave is controlled by the eUSCI_B module</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSWACK_1</name>
                  <value>0x1</value>
                  <description>The user needs to trigger the sending of the address ACK by issuing UCTXACK</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSTPNACK</name>
              <description>[5:5] ACK all master bytes</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSTPNACK_0</name>
                  <value>0x0</value>
                  <description>Send a non-acknowledge before the STOP condition as a master receiver (conform to I2C standard)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSTPNACK_1</name>
                  <value>0x1</value>
                  <description>All bytes are acknowledged by the eUSCI_B when configured as master receiver</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCCLTO</name>
              <description>[7:6] Clock low timeout select</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCCLTO_0</name>
                  <value>0x0</value>
                  <description>Disable clock low timeout counter</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCCLTO_1</name>
                  <value>0x1</value>
                  <description>135 000 SYSCLK cycles (approximately 28 ms)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCCLTO_2</name>
                  <value>0x2</value>
                  <description>150 000 SYSCLK cycles (approximately 31 ms)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCCLTO_3</name>
                  <value>0x3</value>
                  <description>165 000 SYSCLK cycles (approximately 34 ms)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCETXINT</name>
              <description>[8:8] Early UCTXIFG0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCETXINT_0</name>
                  <value>0x0</value>
                  <description>UCTXIFGx is set after an address match with UCxI2COAx and the direction bit indicating slave transmit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCETXINT_1</name>
                  <value>0x1</value>
                  <description>UCTXIFG0 is set for each START condition</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB2BRW</name>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx Baud Rate Control Word Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB2BRW_SPI</name>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx Bit Rate Control Register 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB2STATW</name>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx Status Register</description>
          <fields>
            <field>
              <name>UCBBUSY</name>
              <description>[4:4] Bus busy</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <value>0x0</value>
                  <description>Bus inactive</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <value>0x1</value>
                  <description>Bus busy</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCGC</name>
              <description>[5:5] General call address received</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCGC_0</name>
                  <value>0x0</value>
                  <description>No general call address received</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCGC_1</name>
                  <value>0x1</value>
                  <description>General call address received</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSCLLOW</name>
              <description>[6:6] SCL low</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSCLLOW_0</name>
                  <value>0x0</value>
                  <description>SCL is not held low</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSCLLOW_1</name>
                  <value>0x1</value>
                  <description>SCL is held low</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCBCNT</name>
              <description>[15:8] Hardware byte counter value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB2STATW_SPI</name>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <description>UCB2STATW_SPI</description>
          <fields>
            <field>
              <name>UCOE</name>
              <description>[5:5] Overrun error flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCOE_0</name>
                  <value>0x0</value>
                  <description>No error</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCOE_1</name>
                  <value>0x1</value>
                  <description>Overrun error occurred</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCFE</name>
              <description>[6:6] Framing error flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCFE_0</name>
                  <value>0x0</value>
                  <description>No error</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCFE_1</name>
                  <value>0x1</value>
                  <description>Bus conflict occurred</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCLISTEN</name>
              <description>[7:7] Listen enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCLISTEN_0</name>
                  <value>0x0</value>
                  <description>Disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCLISTEN_1</name>
                  <value>0x1</value>
                  <description>Enabled. UCBxTXD is internally fed back to the receiver</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB2TBCNT</name>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx Byte Counter Threshold Register</description>
          <fields>
            <field>
              <name>UCTBCNT</name>
              <description>[7:0] Byte counter threshold value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB2RXBUF</name>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx Receive Buffer Register</description>
          <fields>
            <field>
              <name>UCRXBUF</name>
              <description>[7:0] Receive data buffer</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB2RXBUF_SPI</name>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx Receive Buffer Register</description>
          <fields>
            <field>
              <name>UCRXBUF</name>
              <description>[7:0] Receive data buffer</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB2TXBUF</name>
          <addressOffset>0xE</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx Transmit Buffer Register</description>
          <fields>
            <field>
              <name>UCTXBUF</name>
              <description>[7:0] Transmit data buffer</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB2TXBUF_SPI</name>
          <addressOffset>0xE</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx Transmit Buffer Register</description>
          <fields>
            <field>
              <name>UCTXBUF</name>
              <description>[7:0] Transmit data buffer</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB2I2COA0</name>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx I2C Own Address 0 Register</description>
          <fields>
            <field>
              <name>I2COA0</name>
              <description>[9:0] I2C own address</description>
              <bitWidth>10</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCOAEN</name>
              <description>[10:10] Own Address enable register</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>The slave address defined in I2COA0 is disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>The slave address defined in I2COA0 is enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCGCEN</name>
              <description>[15:15] General call response enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCGCEN_0</name>
                  <value>0x0</value>
                  <description>Do not respond to a general call</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCGCEN_1</name>
                  <value>0x1</value>
                  <description>Respond to a general call</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB2I2COA1</name>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx I2C Own Address 1 Register</description>
          <fields>
            <field>
              <name>I2COA1</name>
              <description>[9:0] I2C own address</description>
              <bitWidth>10</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCOAEN</name>
              <description>[10:10] Own Address enable register</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>The slave address defined in I2COA1 is disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>The slave address defined in I2COA1 is enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB2I2COA2</name>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx I2C Own Address 2 Register</description>
          <fields>
            <field>
              <name>I2COA2</name>
              <description>[9:0] I2C own address</description>
              <bitWidth>10</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCOAEN</name>
              <description>[10:10] Own Address enable register</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>The slave address defined in I2COA2 is disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>The slave address defined in I2COA2 is enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB2I2COA3</name>
          <addressOffset>0x1A</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx I2C Own Address 3 Register</description>
          <fields>
            <field>
              <name>I2COA3</name>
              <description>[9:0] I2C own address</description>
              <bitWidth>10</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCOAEN</name>
              <description>[10:10] Own Address enable register</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                  <description>The slave address defined in I2COA3 is disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                  <description>The slave address defined in I2COA3 is enabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB2ADDRX</name>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx I2C Received Address Register</description>
          <fields>
            <field>
              <name>ADDRX</name>
              <description>[9:0] Received Address Register</description>
              <bitWidth>10</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB2ADDMASK</name>
          <addressOffset>0x1E</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx I2C Address Mask Register</description>
          <fields>
            <field>
              <name>ADDMASK</name>
              <description>[9:0] Address Mask Register. By clearing the corresponding bit of the own address, this bit is a don't care when comparing the address on the bus to the own address. Using this method, it is possible to react on more than one slave address. When all bits of ADDMASKx are set, the address mask feature is deactivated. Modify only when UCSWRST = 1.</description>
              <bitWidth>10</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB2I2CSA</name>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <description>eUSCI_Bx I2C Slave Address Register</description>
          <fields>
            <field>
              <name>I2CSA</name>
              <description>[9:0] I2C slave address</description>
              <bitWidth>10</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
